#ifndef __CONSTANTS_OUTPUTS__
#define __CONSTANTS_OUTPUTS__

#define EKRAN_LIST_OUTPUTS_FOR_RANGUVANNJA        (EKRAN_LIST_INPUTS_FOR_RANGUVANNJA + 1)

#define EKRAN_RANGUVANNJA_OUTPUT_1                (EKRAN_RANGUVANNJA_INPUT_LAST + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_2                (EKRAN_RANGUVANNJA_OUTPUT_1 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_3                (EKRAN_RANGUVANNJA_OUTPUT_2 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_4                (EKRAN_RANGUVANNJA_OUTPUT_3 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_5                (EKRAN_RANGUVANNJA_OUTPUT_4 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_6                (EKRAN_RANGUVANNJA_OUTPUT_5 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_7                (EKRAN_RANGUVANNJA_OUTPUT_6 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_8                (EKRAN_RANGUVANNJA_OUTPUT_7 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_9                (EKRAN_RANGUVANNJA_OUTPUT_8 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_10               (EKRAN_RANGUVANNJA_OUTPUT_9 + 1)

#define EKRAN_RANGUVANNJA_OUTPUT_LAST             EKRAN_RANGUVANNJA_OUTPUT_10

#define MAX_ROW_LIST_OUTPUTS_FOR_RANGUVANNJA       (NUMBER_SIMPLE_OUTPUTS + ((current_settings.configuration & (1 << DS_BIT_CONFIGURATION)) != 0)*NUMBER_DS)
#define MAX_ROW_RANGUVANNJA_OUTPUT                 NUMBER_TOTAL_SIGNAL_FOR_RANG

#define NAME_RANG_RU    \
  "  Áëîê.âêë.ÂÂ   ",   \
  " Ñáðîñ èíäèêàöèè",   \
  "   Ñáðîñ ðåëå   ",   \
  " Ìåñòí./Äèñòàíö.",   \
  "  Ïîëîæåíèå ÂÂ  ",   \
  "Îòêë.îò âí.çàùèò",   \
  "    Îòêë.ÂÂ     ",   \
  "     Âêë.ÂÂ     ",   \
  " Êîíòðîëü Îòêë. ",   \
  " Êîíòðîëü Âêë.  ",   \
  "   Ïðèâîä ÂÂ    ",   \
  " Ïðåâ.Iîò.íîì.  ",   \
  " Êðèò.Ðåñóðñ ÂÂ ",   \
  " Èñ÷.Ðåñóðñ ÂÂ  ",   \
  "  Âí.äîñòóï ÄÂõ ",   \
  "  Âí.äîñòóï ÔÊ  ",   \
  "  Âí.äîñòóï LAN ",   \
  " Âí.äîñòóï GOOSE",   \
  "  Âí.äîñòóï USB ",   \
  " Âí.äîñòóï RS485",   \
  "  Íåèñïð.Îáùàÿ  ",   \
  "  Íåèñïð.Àâàð.  ",   \
  " Ðàáîòà Àí.Ðåã. ",   \
  " Ðàáîòà Ä.Ðåã.  ",   \
  " Îòêë.îò çàùèò  ",   \
  "       ÁÎ       ",   \
  "       ÁÂ       ",   \
  "  Ãð.óñòàâîê 1  ",   \
  "  Ãð.óñòàâîê 2  ",   \
  "  Ãð.óñòàâîê 3  ",   \
  "  Ãð.óñòàâîê 4  ",   \
  " Â Ãð Óñò îò Ì  ",   \
  "Áëê.ãð.óñò.îò ç.",   \
  " Ñ.áëê.Ãîò.ê ÒÓ ",   \
  " Ãîòîâíîñòü ê ÒÓ",   \
  "  Èçì.íàñòðîåê  ",   \
  " Áëîê.Âõ.GOOSExx",   \
  "  Áëîê.Âõ.MMSx  ",   \
  "   Áëîê.ÂÑÁx    ",   \
  "   Áëîê.ÌÒÇ 1   ",   \
  "   Áëîê.ÌÒÇ 2   ",   \
  " Áëîê.óñê.ÌÒÇ 2 ",   \
  "   Áëîê.ÌÒÇ 3   ",   \
  "   Áëîê.ÌÒÇ 4   ",   \
  " Ñåêò.ÌÒÇÍ 1 Ïð.",   \
  "Ñåêò.ÌÒÇÍ 1 Îáð.",   \
  "    ÏÎ ÌÒÇ 1    ",   \
  " ÏÎ ÌÒÇÍ 1 Ïð.  ",   \
  " ÏÎ ÌÒÇÍ 1 Îáð. ",   \
  "  ÏÎ U ÌÒÇÏÍ 1  ",   \
  "   ÏÎ ÌÒÇÏÍ 1   ",   \
  "     ÌÒÇ 1      ",   \
  " Ñåêò.ÌÒÇÍ 2 Ïð.",   \
  "Ñåêò.ÌÒÇÍ 2 Îáð.",   \
  "    ÏÎ ÌÒÇ 2    ",   \
  " ÏÎ ÌÒÇÍ 2 Ïð.  ",   \
  " ÏÎ ÌÒÇÍ 2 Îáð. ",   \
  "  ÏÎ U ÌÒÇÏÍ 2  ",   \
  "   ÏÎ ÌÒÇÏÍ 2   ",   \
  "     ÌÒÇ 2      ",   \
  " Ñåêò.ÌÒÇÍ 3 Ïð.",   \
  "Ñåêò.ÌÒÇÍ 3 Îáð.",   \
  "    ÏÎ ÌÒÇ 3    ",   \
  " ÏÎ ÌÒÇÍ 3 Ïð.  ",   \
  " ÏÎ ÌÒÇÍ 3 Îáð. ",   \
  "  ÏÎ U ÌÒÇÏÍ 3  ",   \
  "   ÏÎ ÌÒÇÏÍ 3   ",   \
  "     ÌÒÇ 3      ",   \
  " Ñåêò.ÌÒÇÍ 4 Ïð.",   \
  "Ñåêò.ÌÒÇÍ 4 Îáð.",   \
  "    ÏÎ ÌÒÇ 4    ",   \
  " ÏÎ ÌÒÇÍ 4 Ïð.  ",   \
  " ÏÎ ÌÒÇÍ 4 Îáð. ",   \
  "  ÏÎ U ÌÒÇÏÍ 4  ",   \
  "   ÏÎ ÌÒÇÏÍ 4   ",   \
  "     ÌÒÇ 4      ",   \
  " ÏÎ áëîê.U ÌÒÇÍ ",   \
  "    ÍÖÍ-ÌÒÇ     ",   \
  "Áëîê.ÌÒÇ 0.4êÂ 1",   \
  "Áëîê.ÌÒÇ 0.4êÂ 2",   \
  "Áë.ó.ÌÒÇ 0.4êÂ 2",   \
  " ÏÎ ÌÒÇ 0.4êÂ 1 ",   \
  "  ÌÒÇ 0.4êÂ 1   ",   \
  " ÏÎ ÌÒÇ 0.4êÂ 2 ",   \
  "  ÌÒÇ 0.4êÂ 2   ",   \
  "   Áëîê.ÇÍàì    ",   \
  "    ÏÎ ÇÍàì     ",   \
  "      ÇÍàì      ",   \
  "    Áëîê.ÇÄÇ    ",   \
  " Ïóñê ÇÄÇ îò ÄÂ ",   \
  " Ñâåò ÇÄÇ îò ÄÂ ",   \
  "     ÏÎ ÇÄÇ     ",   \
  "      ÇÄÇ       ",   \
  "    Áëîê.ÍÇÇ    ",   \
  "     ÏÎ ÍÇÇ     ",   \
  "      ÍÇÇ       ",   \
  "   ÏÎ ÇÇ(3I0)   ",   \
  "    ÇÇ(3I0)     ",   \
  "   ÏÎ ÇÇ(3U0)   ",   \
  "    ÇÇ(3U0)     ",   \
  "   Ñåêòîð ÍÇÇ   ",   \
  "  Áëîê.ÒÇÍÏ 1   ",   \
  " Ñåêò.ÒÇÍÏ 1 Ïð.",   \
  "Ñåêò.ÒÇÍÏ 1 Îáð.",   \
  "ÏÎ 3I0 ÒÇÍÏ1 Ïð.",   \
  "ÏÎ 3I0 ÒÇÍÏ1 Îáð",   \
  "ÏÎ 3U0 ÒÇÍÏ1 Ïð.",   \
  "ÏÎ 3U0 ÒÇÍÏ1 Îáð",   \
  " ÏÎ ÒÇÍÏ 1 Ïð.  ",   \
  " ÏÎ ÒÇÍÏ 1 Îáð. ",   \
  "     ÒÇÍÏ 1     ",   \
  "  Áëîê.ÒÇÍÏ 2   ",   \
  " Ñåêò.ÒÇÍÏ 2 Ïð.",   \
  "Ñåêò.ÒÇÍÏ 2 Îáð.",   \
  "ÏÎ 3I0 ÒÇÍÏ2 Ïð.",   \
  "ÏÎ 3I0 ÒÇÍÏ2 Îáð",   \
  "ÏÎ 3U0 ÒÇÍÏ2 Ïð.",   \
  "ÏÎ 3U0 ÒÇÍÏ2 Îáð",   \
  " ÏÎ ÒÇÍÏ 2 Ïð.  ",   \
  " ÏÎ ÒÇÍÏ 2 Îáð. ",   \
  "     ÒÇÍÏ 2     ",   \
  "  Áëîê.ÒÇÍÏ 3   ",   \
  " Ñåêò.ÒÇÍÏ 3 Ïð.",   \
  "Ñåêò.ÒÇÍÏ 3 Îáð.",   \
  "ÏÎ 3I0 ÒÇÍÏ3 Ïð.",   \
  "ÏÎ 3I0 ÒÇÍÏ3 Îáð",   \
  "ÏÎ 3U0 ÒÇÍÏ3 Ïð.",   \
  "ÏÎ 3U0 ÒÇÍÏ3 Îáð",   \
  " ÏÎ ÒÇÍÏ 3 Ïð.  ",   \
  " ÏÎ ÒÇÍÏ 3 Îáð. ",   \
  "     ÒÇÍÏ 3     ",   \
  " Ñòàò.áëîê.ÀÏÂ  ",   \
  "      ÀÏÂ       ",   \
  "     ÀÏÂ 2      ",   \
  "     ÀÏÂ 3      ",   \
  "     ÀÏÂ 4      ",   \
  "   Ðàáîòà ÀÏÂ   ",   \
  " À×Ð/×ÀÏÂ îò ÄÂ ",   \
  "   Áëîê.À×Ð 1   ",   \
  "   Áëîê.À×Ð 2   ",   \
  "   Ðàçð.×ÀÏÂ    ",   \
  "   Áëîê.×ÀÏÂ    ",   \
  "    ÏÎ À×Ð 1    ",   \
  "   ÏÎ ×ÀÏÂ 1    ",   \
  "   À×Ð/×ÀÏÂ 1   ",   \
  "    ÏÎ À×Ð 2    ",   \
  "   ÏÎ ×ÀÏÂ 2    ",   \
  "   À×Ð/×ÀÏÂ 2   ",   \
  "   Áëîê.ÓÐÎÂ    ",   \
  " Ïóñê ÓÐÎÂ îò ÄÂ",   \
  "    ÏÎ ÓÐÎÂ     ",   \
  "     ÓÐÎÂ 1     ",   \
  "     ÓÐÎÂ 2     ",   \
  "  Áëîê.ÇÎÏ(I)   ",   \
  "   ÏÎ ÇÎÏ(I)    ",   \
  "     ÇÎÏ(I)     ",   \
  "  Áëîê.Umin 1   ",   \
  "  Ïóñê Umin 1   ",   \
  "  Áëîê.Umin 2   ",   \
  "  Ïóñê Umin 2   ",   \
  "   ÏÎ Umin 1    ",   \
  " ÏÎ Uáëê.Umin 1 ",   \
  " ÏÎ Iáëê.Umin 1 ",   \
  "     Umin 1     ",   \
  "   ÏÎ Umin 2    ",   \
  " ÏÎ Uáëê.Umin 2 ",   \
  " ÏÎ Iáëê.Umin 2 ",   \
  "     Umin 2     ",   \
  "  Áëîê.Umax 1   ",   \
  "   ÏÎ Umax 1    ",   \
  "     Umax 1     ",   \
  "  Áëîê.Umax 2   ",   \
  "   ÏÎ Umax 2    ",   \
  "     Umax 2     ",   \
  "   Áëîê.ÓÇ x    ",   \
  "    ÏÎ ÓÇ x     ",   \
  "      ÓÇ x      ",   \
  " Âõ.Î-ôóíêöèè 1 ",   \
  " Ñáð.Î-ôóíêöèè 1",   \
  " Âûõ.Î-ôóíêöèè 1",   \
  " Âõ.Î-ôóíêöèè 2 ",   \
  " Ñáð.Î-ôóíêöèè 2",   \
  " Âûõ.Î-ôóíêöèè 2",   \
  " Âõ.Î-ôóíêöèè 3 ",   \
  " Ñáð.Î-ôóíêöèè 3",   \
  " Âûõ.Î-ôóíêöèè 3",   \
  " Âõ.Î-ôóíêöèè 4 ",   \
  " Ñáð.Î-ôóíêöèè 4",   \
  " Âûõ.Î-ôóíêöèè 4",   \
  " Âõ.Î-ôóíêöèè 5 ",   \
  " Ñáð.Î-ôóíêöèè 5",   \
  " Âûõ.Î-ôóíêöèè 5",   \
  " Âõ.Î-ôóíêöèè 6 ",   \
  " Ñáð.Î-ôóíêöèè 6",   \
  " Âûõ.Î-ôóíêöèè 6",   \
  " Âõ.Î-ôóíêöèè 7 ",   \
  " Ñáð.Î-ôóíêöèè 7",   \
  " Âûõ.Î-ôóíêöèè 7",   \
  " Âõ.Î-ôóíêöèè 8 ",   \
  " Ñáð.Î-ôóíêöèè 8",   \
  " Âûõ.Î-ôóíêöèè 8",   \
  "Óñò.Î-òðèããåðà 1",   \
  "Ñáð.Î-òðèããåðà 1",   \
  "Âûõ.Î-òðèããåðà 1",   \
  "Óñò.Î-òðèããåðà 2",   \
  "Ñáð.Î-òðèããåðà 2",   \
  "Âûõ.Î-òðèããåðà 2",   \
  "Óñò.Î-òðèããåðà 3",   \
  "Ñáð.Î-òðèããåðà 3",   \
  "Âûõ.Î-òðèããåðà 3",   \
  "Óñò.Î-òðèããåðà 4",   \
  "Ñáð.Î-òðèããåðà 4",   \
  "Âûõ.Î-òðèããåðà 4",   \
  "     Î-È 1      ",   \
  "     Î-È 2      ",   \
  "     Î-È 3      ",   \
  "     Î-È 4      ",   \
  "     Î-È 5      ",   \
  "     Î-È 6      ",   \
  "     Î-È 7      ",   \
  "     Î-È 8      ",   \
  "    Î-ÈËÈ 1     ",   \
  "    Î-ÈËÈ 2     ",   \
  "    Î-ÈËÈ 3     ",   \
  "    Î-ÈËÈ 4     ",   \
  "    Î-ÈËÈ 5     ",   \
  "    Î-ÈËÈ 6     ",   \
  "    Î-ÈËÈ 7     ",   \
  "    Î-ÈËÈ 8     ",   \
  "  Î-Èñêë.ÈËÈ 1  ",   \
  "  Î-Èñêë.ÈËÈ 2  ",   \
  "  Î-Èñêë.ÈËÈ 3  ",   \
  "  Î-Èñêë.ÈËÈ 4  ",   \
  "  Î-Èñêë.ÈËÈ 5  ",   \
  "  Î-Èñêë.ÈËÈ 6  ",   \
  "  Î-Èñêë.ÈËÈ 7  ",   \
  "  Î-Èñêë.ÈËÈ 8  ",   \
  "     Î-ÍÅ 1     ",   \
  "     Î-ÍÅ 2     ",   \
  "     Î-ÍÅ 3     ",   \
  "     Î-ÍÅ 4     ",   \
  "     Î-ÍÅ 5     ",   \
  "     Î-ÍÅ 6     ",   \
  "     Î-ÍÅ 7     ",   \
  "     Î-ÍÅ 8     ",   \
  "     Î-ÍÅ 9     ",   \
  "    Î-ÍÅ 10     ",   \
  "    Î-ÍÅ 11     ",   \
  "    Î-ÍÅ 12     ",   \
  "    Î-ÍÅ 13     ",   \
  "    Î-ÍÅ 14     ",   \
  "    Î-ÍÅ 15     ",   \
  "    Î-ÍÅ 16     ",   \
  "      ÔÑ 1      ",   \
  "      ÔÑ 2      ",   \
  "      ÔÑ 3      ",   \
  "      ÔÑ 4      ",   \
  "      ÔÑ 5      ",   \
  "      ÔÑ 6      ",   \
  "      ÔÑ 7      ",   \
  "      ÔÑ 8      ",   \
  "      ÔÑ 9      ",   \
  "     ÔÑ 10      ",   \
  "     ÔÑ 11      ",   \
  "     ÔÑ 12      ",   \
  "     ÔÑ 13      ",   \
  "     ÔÑ 14      ",   \
  "     ÔÑ 15      ",   \
  "     ÔÑ 16      ",   \
  " Îø.íàñòð.ð.ëîã."

#define NAME_RANG_UA    \
  " Áëîê.óâ³ìêí.ÂÂ ",   \
  " Ñêèä.³íäèêàö³¿ ",   \
  "   Ñêèä.ðåëå    ",   \
  " Ì³ñö./Äèñòàíö. ",   \
  "    Ñòàí ÂÂ     ",   \
  "Âèìê.â³ä çîâí.ç.",   \
  "    Âèìê.ÂÂ     ",   \
  "    Óâ³ìê.ÂÂ    ",   \
  " Êîíòðîëü Âèìê. ",   \
  " Êîíòðîëü Óâ³ìê.",   \
  "   Ïðèâ³ä ÂÂ    ",   \
  " Ïåðåâ.Iâ.íîì.  ",   \
  " Êðèò.Ðåñóðñ ÂÂ ",   \
  " Âè÷.Ðåñóðñ ÂÂ  ",   \
  " Çîâí.äîñò.ÄÂõ  ",   \
  "  Çîâí.äîñò.ÔÊ  ",   \
  " Çîâí.äîñò.LAN  ",   \
  " Çîâí.äîñò.GOOSE",   \
  " Çîâí.äîñò.USB  ",   \
  " Çîâí.äîñò.RS485",   \
  " Íåñïð.Çàãàëüíà ",   \
  "  Íåñïð.Àâàð.   ",   \
  " Ðîá.Àí.Ðåºñòð. ",   \
  " Ðîá.Ä.Ðåºñòð.  ",   \
  " Âèìê.â³ä çàõ.  ",   \
  "     ÁÂèìê.     ",   \
  "    ÁÓâ³ìê.     ",   \
  "  Ãð.óñòàâîê 1  ",   \
  "  Ãð.óñòàâîê 2  ",   \
  "  Ãð.óñòàâîê 3  ",   \
  "  Ãð.óñòàâîê 4  ",   \
  " Â Ãð Óñò â³ä Ì ",   \
  "Áë.ãð.óñò.â³ä ç.",   \
  " Ñ.áëê.Ãîò.äî ÒÓ",   \
  "Ãîòîâí³ñòü äî ÒÓ",   \
  " Çì.íàëàøòóâàííÿ",   \
  " Áëîê.Âõ.GOOSExx",   \
  "  Áëîê.Âõ.MMSx  ",   \
  "   Áëîê.ÂÌÁx    ",   \
  "   Áëîê.ÌÑÇ 1   ",   \
  "   Áëîê.ÌÑÇ 2   ",   \
  "Áëîê.ïðèñê.ÌÑÇ 2",   \
  "   Áëîê.ÌÑÇ 3   ",   \
  "   Áëîê.ÌÑÇ 4   ",   \
  " Ñåêò.ÌÑÇÑ 1 Ïð.",   \
  " Ñåêò.ÌÑÇÑ 1 Çâ.",   \
  "    ÏÎ ÌÑÇ 1    ",   \
  " ÏÎ ÌÑÇÑ 1 Ïð.  ",   \
  " ÏÎ ÌÑÇÑ 1 Çâ.  ",   \
  "  ÏÎ U ÌÑÇÏÍ 1  ",   \
  "   ÏÎ ÌÑÇÏÍ 1   ",   \
  "     ÌÑÇ 1      ",   \
  " Ñåêò.ÌÑÇÑ 2 Ïð.",   \
  " Ñåêò.ÌÑÇÑ 2 Çâ.",   \
  "    ÏÎ ÌÑÇ 2    ",   \
  " ÏÎ ÌÑÇÑ 2 Ïð.  ",   \
  " ÏÎ ÌÑÇÑ 2 Çâ.  ",   \
  "  ÏÎ U ÌÑÇÏÍ 2  ",   \
  "   ÏÎ ÌÑÇÏÍ 2   ",   \
  "     ÌÑÇ 2      ",   \
  " Ñåêò.ÌÑÇÑ 3 Ïð.",   \
  " Ñåêò.ÌÑÇÑ 3 Çâ.",   \
  "    ÏÎ ÌÑÇ 3    ",   \
  " ÏÎ ÌÑÇÑ 3 Ïð.  ",   \
  " ÏÎ ÌÑÇÑ 3 Çâ.  ",   \
  "  ÏÎ U ÌÑÇÏÍ 3  ",   \
  "   ÏÎ ÌÑÇÏÍ 3   ",   \
  "     ÌÑÇ 3      ",   \
  " Ñåêò.ÌÑÇÑ 4 Ïð.",   \
  " Ñåêò.ÌÑÇÑ 4 Çâ.",   \
  "    ÏÎ ÌÑÇ 4    ",   \
  " ÏÎ ÌÑÇÑ 4 Ïð.  ",   \
  " ÏÎ ÌÑÇÑ 4 Çâ.  ",   \
  "  ÏÎ U ÌÑÇÏÍ 4  ",   \
  "   ÏÎ ÌÑÇÏÍ 4   ",   \
  "     ÌÑÇ 4      ",   \
  " ÏÎ áëîê.U ÌÑÇÑ ",   \
  "    ÍÊÍ-ÌÑÇ     ",   \
  "Áëîê.ÌÑÇ 0.4êÂ 1",   \
  "Áëîê.ÌÑÇ 0.4êÂ 2",   \
  "Áë.ï.ÌÑÇ 0.4êÂ 2",   \
  " ÏÎ ÌÑÇ 0.4êÂ 1 ",   \
  "  ÌÑÇ 0.4êÂ 1   ",   \
  " ÏÎ ÌÑÇ 0.4êÂ 2 ",   \
  "  ÌÑÇ 0.4êÂ 2   ",   \
  "   Áëîê.ÇÍàì    ",   \
  "    ÏÎ ÇÍàì     ",   \
  "      ÇÍàì      ",   \
  "    Áëîê.ÇÄÇ    ",   \
  " Ïóñê ÇÄÇ â³ä ÄÂ",   \
  " Ñâ.ÇÄÇ â³ä ÄÂ  ",   \
  "     ÏÎ ÇÄÇ     ",   \
  "      ÇÄÇ       ",   \
  "    Áëîê.ÑÇÇ    ",   \
  "     ÏÎ ÑÇÇ     ",   \
  "      ÑÇÇ       ",   \
  "   ÏÎ ÇÇ(3I0)   ",   \
  "    ÇÇ(3I0)     ",   \
  "   ÏÎ ÇÇ(3U0)   ",   \
  "    ÇÇ(3U0)     ",   \
  "   Ñåêòîð ÑÇÇ   ",   \
  "  Áëîê.ÑÇÍÏ 1   ",   \
  " Ñåêò.ÑÇÍÏ 1 Ïð.",   \
  " Ñåêò.ÑÇÍÏ 1 Çâ.",   \
  "ÏÎ 3I0 ÑÇÍÏ1 Ïð.",   \
  "ÏÎ 3I0 ÑÇÍÏ1 Çâ.",   \
  "ÏÎ 3U0 ÑÇÍÏ1 Ïð.",   \
  "ÏÎ 3U0 ÑÇÍÏ1 Çâ.",   \
  " ÏÎ ÑÇÍÏ 1 Ïð.  ",   \
  " ÏÎ ÑÇÍÏ 1 Çâ.  ",   \
  "     ÑÇÍÏ 1     ",   \
  "  Áëîê.ÑÇÍÏ 2   ",   \
  " Ñåêò.ÑÇÍÏ 2 Ïð.",   \
  " Ñåêò.ÑÇÍÏ 2 Çâ.",   \
  "ÏÎ 3I0 ÑÇÍÏ2 Ïð.",   \
  "ÏÎ 3I0 ÑÇÍÏ2 Çâ.",   \
  "ÏÎ 3U0 ÑÇÍÏ2 Ïð.",   \
  "ÏÎ 3U0 ÑÇÍÏ2 Çâ.",   \
  " ÏÎ ÑÇÍÏ 2 Ïð.  ",   \
  " ÏÎ ÑÇÍÏ 2 Çâ.  ",   \
  "     ÑÇÍÏ 2     ",   \
  "  Áëîê.ÑÇÍÏ 3   ",   \
  " Ñåêò.ÑÇÍÏ 3 Ïð.",   \
  " Ñåêò.ÑÇÍÏ 3 Çâ.",   \
  "ÏÎ 3I0 ÑÇÍÏ3 Ïð.",   \
  "ÏÎ 3I0 ÑÇÍÏ3 Çâ.",   \
  "ÏÎ 3U0 ÑÇÍÏ3 Ïð.",   \
  "ÏÎ 3U0 ÑÇÍÏ3 Çâ.",   \
  " ÏÎ ÑÇÍÏ 3 Ïð.  ",   \
  " ÏÎ ÑÇÍÏ 3 Çâ.  ",   \
  "     ÑÇÍÏ 3     ",   \
  " Ñòàò.áëîê.ÀÏÂ  ",   \
  "      ÀÏÂ       ",   \
  "     ÀÏÂ 2      ",   \
  "     ÀÏÂ 3      ",   \
  "     ÀÏÂ 4      ",   \
  "   Ðîáîòà ÀÏÂ   ",   \
  " À×Ð/×ÀÏÂ â³ä ÄÂ",   \
  "   Áëîê.À×Ð 1   ",   \
  "   Áëîê.À×Ð 2   ",   \
  "  Äîçâ³ë ×ÀÏÂ   ",   \
  "   Áëîê.×ÀÏÂ    ",   \
  "    ÏÎ À×Ð 1    ",   \
  "   ÏÎ ×ÀÏÂ 1    ",   \
  "   À×Ð/×ÀÏÂ 1   ",   \
  "    ÏÎ À×Ð 2    ",   \
  "   ÏÎ ×ÀÏÂ 2    ",   \
  "   À×Ð/×ÀÏÂ 2   ",   \
  "   Áëîê.ÏÐÂÂ    ",   \
  "Ïóñê ÏÐÂÂ â³ä ÄÂ",   \
  "    ÏÎ ÏÐÂÂ     ",   \
  "     ÏÐÂÂ 1     ",   \
  "     ÏÐÂÂ 2     ",   \
  "  Áëîê.ÇÇÏ(I)   ",   \
  "   ÏÎ ÇÇÏ(I)    ",   \
  "     ÇÇÏ(I)     ",   \
  "  Áëîê.Umin 1   ",   \
  "  Ïóñê Umin 1   ",   \
  "  Áëîê.Umin 2   ",   \
  "  Ïóñê Umin 2   ",   \
  "   ÏÎ Umin 1    ",   \
  " ÏÎ Uáëê.Umin 1 ",   \
  " ÏÎ Iáëê.Umin 1 ",   \
  "     Umin 1     ",   \
  "   ÏÎ Umin 2    ",   \
  " ÏÎ Uáëê.Umin 2 ",   \
  " ÏÎ Iáëê.Umin 2 ",   \
  "     Umin 2     ",   \
  "  Áëîê.Umax 1   ",   \
  "   ÏÎ Umax 1    ",   \
  "     Umax 1     ",   \
  "  Áëîê.Umax 2   ",   \
  "   ÏÎ Umax 2    ",   \
  "     Umax 2     ",   \
  "   Áëîê.ÓÇ x    ",   \
  "    ÏÎ ÓÇ x     ",   \
  "      ÓÇ x      ",   \
  " Âõ.Â-ôóíêö³¿ 1 ",   \
  " Ñê.Â-ôóíêö³¿ 1 ",   \
  " Âèõ.Â-ôóíêö³¿ 1",   \
  " Âõ.Â-ôóíêö³¿ 2 ",   \
  " Ñê.Â-ôóíêö³¿ 2 ",   \
  " Âèõ.Â-ôóíêö³¿ 2",   \
  " Âõ.Â-ôóíêö³¿ 3 ",   \
  " Ñê.Â-ôóíêö³¿ 3 ",   \
  " Âèõ.Â-ôóíêö³¿ 3",   \
  " Âõ.Â-ôóíêö³¿ 4 ",   \
  " Ñê.Â-ôóíêö³¿ 4 ",   \
  " Âèõ.Â-ôóíêö³¿ 4",   \
  " Âõ.Â-ôóíêö³¿ 5 ",   \
  " Ñê.Â-ôóíêö³¿ 5 ",   \
  " Âèõ.Â-ôóíêö³¿ 5",   \
  " Âõ.Â-ôóíêö³¿ 6 ",   \
  " Ñê.Â-ôóíêö³¿ 6 ",   \
  " Âèõ.Â-ôóíêö³¿ 6",   \
  " Âõ.Â-ôóíêö³¿ 7 ",   \
  " Ñê.Â-ôóíêö³¿ 7 ",   \
  " Âèõ.Â-ôóíêö³¿ 7",   \
  " Âõ.Â-ôóíêö³¿ 8 ",   \
  " Ñê.Â-ôóíêö³¿ 8 ",   \
  " Âèõ.Â-ôóíêö³¿ 8",   \
  " Âñò.Â-òðè´åðà 1",   \
  " Ñê.Â-òðè´åðà 1 ",   \
  " Âèõ.Â-òðè´åðà 1",   \
  " Âñò.Â-òðè´åðà 2",   \
  " Ñê.Â-òðè´åðà 2 ",   \
  " Âèõ.Â-òðè´åðà 2",   \
  " Âñò.Â-òðè´åðà 3",   \
  " Ñê.Â-òðè´åðà 3 ",   \
  " Âèõ.Â-òðè´åðà 3",   \
  " Âñò.Â-òðè´åðà 4",   \
  " Ñê.Â-òðè´åðà 4 ",   \
  " Âèõ.Â-òðè´åðà 4",   \
  "     Â-² 1      ",   \
  "     Â-² 2      ",   \
  "     Â-² 3      ",   \
  "     Â-² 4      ",   \
  "     Â-² 5      ",   \
  "     Â-² 6      ",   \
  "     Â-² 7      ",   \
  "     Â-² 8      ",   \
  "    Â-ÀÁÎ 1     ",   \
  "    Â-ÀÁÎ 2     ",   \
  "    Â-ÀÁÎ 3     ",   \
  "    Â-ÀÁÎ 4     ",   \
  "    Â-ÀÁÎ 5     ",   \
  "    Â-ÀÁÎ 6     ",   \
  "    Â-ÀÁÎ 7     ",   \
  "    Â-ÀÁÎ 8     ",   \
  "  Â-Âèêë.ÀÁÎ 1  ",   \
  "  Â-Âèêë.ÀÁÎ 2  ",   \
  "  Â-Âèêë.ÀÁÎ 3  ",   \
  "  Â-Âèêë.ÀÁÎ 4  ",   \
  "  Â-Âèêë.ÀÁÎ 5  ",   \
  "  Â-Âèêë.ÀÁÎ 6  ",   \
  "  Â-Âèêë.ÀÁÎ 7  ",   \
  "  Â-Âèêë.ÀÁÎ 8  ",   \
  "     Â-ÍÅ 1     ",   \
  "     Â-ÍÅ 2     ",   \
  "     Â-ÍÅ 3     ",   \
  "     Â-ÍÅ 4     ",   \
  "     Â-ÍÅ 5     ",   \
  "     Â-ÍÅ 6     ",   \
  "     Â-ÍÅ 7     ",   \
  "     Â-ÍÅ 8     ",   \
  "     Â-ÍÅ 9     ",   \
  "     Â-ÍÅ 10    ",   \
  "     Â-ÍÅ 11    ",   \
  "     Â-ÍÅ 12    ",   \
  "     Â-ÍÅ 13    ",   \
  "     Â-ÍÅ 14    ",   \
  "     Â-ÍÅ 15    ",   \
  "     Â-ÍÅ 16    ",   \
  "      ÔÇ 1      ",   \
  "      ÔÇ 2      ",   \
  "      ÔÇ 3      ",   \
  "      ÔÇ 4      ",   \
  "      ÔÇ 5      ",   \
  "      ÔÇ 6      ",   \
  "      ÔÇ 7      ",   \
  "      ÔÇ 8      ",   \
  "      ÔÇ 9      ",   \
  "     ÔÇ 10      ",   \
  "     ÔÇ 11      ",   \
  "     ÔÇ 12      ",   \
  "     ÔÇ 13      ",   \
  "     ÔÇ 14      ",   \
  "     ÔÇ 15      ",   \
  "     ÔÇ 16      ",   \
  " Ïîì.íàë.ð.ëîã. "
    
#define NAME_RANG_EN    \
  "  CB Close Blk  ",   \
  "   LED Reset    ",   \
  "  Relay Reset   ",   \
  "  Local/Remote  ",   \
  "    CB State    ",   \
  " Ext CB Open Cmd",   \
  "  Open CB Cmd   ",   \
  "  Close CB Cmd  ",   \
  "  Open CB Ctl   ",   \
  " Closing CB Ctl ",   \
  "  CB Actuator   ",   \
  "Rat Trip Cur Exc",   \
  "  CB Crit Res   ",   \
  "   CB Res Exh   ",   \
  " Ext Acc via BI ",   \
  " Ext Acc via UDK",   \
  " Ext Acc via LAN",   \
  "Ext Ac via GOOSE",   \
  " Ext Acc via USB",   \
  "Ext Ac via RS485",   \
  " General Fault  ",   \
  " Emergence Fault",   \
  " Dst Rec InPro  ",   \
  " Bin Rec InPro  ",   \
  " Trip via Prot  ",   \
  "  Open CB Com   ",   \
  "  Close CB Com  ",   \
  " SetPoints Gr-1 ",   \
  " SetPoints Gr-2 ",   \
  " SetPoints Gr-3 ",   \
  " SetPoints Gr-4 ",   \
  " SP Gr Ch via M ",   \
  "SP Gr Chg BI v P",   \
  "Rem Ctr R Bl Res",   \
  "  Rem Ctl Ena   ",   \
  " Settings Change",   \
  " GSERECEIVxx Blk",   \
  " MMSRECEIVx Blk ",   \
  "  NETSENDx Blk  ",   \
  "   OCP 1 Blk    ",   \
  "   OCP 2 Blk    ",   \
  " OCP 2 Acc Blk  ",   \
  "   OCP 3 Blk    ",   \
  "   OCP 4 Blk    ",   \
  " DOCP 1 Fw Sec  ",   \
  " DOCP 1 Bw Sec  ",   \
  "  OCP 1 Start   ",   \
  " DOCP 1 Fw Start",   \
  " DOCP 1 Bw Start",   \
  " VOCP 1 V Start ",   \
  "  VOCP 1 Start  ",   \
  "     OCP 1      ",   \
  " DOCP 2 Fw Sec  ",   \
  " DOCP 2 Bw Sec  ",   \
  "  OCP 2 Start   ",   \
  " DOCP 2 Fw Start",   \
  " DOCP 2 Bw Start",   \
  " VOCP 2 V Start ",   \
  "  VOCP 2 Start  ",   \
  "     OCP 2      ",   \
  " DOCP 3 Fw Sec  ",   \
  " DOCP 3 Bw Sec  ",   \
  "  OCP 3 Start   ",   \
  " DOCP 3 Fw Start",   \
  " DOCP 3 Bw Start",   \
  " VOCP 3 V Start ",   \
  "  VOCP 3 Start  ",   \
  "     OCP 3      ",   \
  " DOCP 4 Fw Sec  ",   \
  " DOCP 4 Bw Sec  ",   \
  "  OCP 4 Start   ",   \
  " DOCP 4 Fw Start",   \
  " DOCP 4 Bw Start",   \
  " VOCP 4 V Start ",   \
  "  VOCP 4 Start  ",   \
  "     OCP 4      ",   \
  "   OCP V Blk    ",   \
  "    OCP VCM     ",   \
  "  LVOCP 1 Blk   ",   \
  "  LVOCP 2 Blk   ",   \
  " LVOCP 2 acc Blk",   \
  " LVOCP 1 Start  ",   \
  "    LVOCP 1     ",   \
  " LVOCP 2 Start  ",   \
  "    LVOCP 2     ",   \
  "    InrP Blk    ",   \
  "   InrP Start   ",   \
  "      InrP      ",   \
  "    AFD Blk     ",   \
  "AFD via BI Start",   \
  " AFD via BI St  ",   \
  "   AFD Start    ",   \
  "      AFD       ",   \
  "   SDEFP Blk    ",   \
  "  SDEFP Start   ",   \
  "     SDEFP      ",   \
  "  SEFOCP Start  ",   \
  "     SEFOCP     ",   \
  "  EFOVP Start   ",   \
  "     EFOVP      ",   \
  "   SDEFP Sec    ",   \
  "   DEFP 1 Blk   ",   \
  " DEFP 1 Sec Fw  ",   \
  " DEFP 1 Sec Bw  ",   \
  "DEFP 1 3I0 Fw St",   \
  "DEFP 1 3I0 Bw St",   \
  "DEFP 1 3V0 Fw St",   \
  "DEFP 1 3V0 Bw St",   \
  "  DEFP 1 Fw St  ",   \
  "  DEFP 1 Bw St  ",   \
  "     DEFP 1     ",   \
  "   DEFP 2 Blk   ",   \
  " DEFP 2 Sec Fw  ",   \
  " DEFP 2 Sec Bw  ",   \
  "DEFP 2 3I0 Fw St",   \
  "DEFP 2 3I0 Bw St",   \
  "DEFP 2 3V0 Fw St",   \
  "DEFP 2 3V0 Bw St",   \
  "  DEFP 2 Fw St  ",   \
  "  DEFP 2 Bw St  ",   \
  "     DEFP 2     ",   \
  "   DEFP 3 Blk   ",   \
  " DEFP 3 Sec Fw  ",   \
  " DEFP 3 Sec Bw  ",   \
  "DEFP 3 3I0 Fw St",   \
  "DEFP 3 3I0 Bw St",   \
  "DEFP 3 3V0 Fw St",   \
  "DEFP 3 3V0 Bw St",   \
  "  DEFP 3 Fw St  ",   \
  "  DEFP 3 Bw St  ",   \
  "     DEFP 3     ",   \
  "     AR Blk     ",   \
  "   AR Cycle 1   ",   \
  "   AR Cycle 2   ",   \
  "   AR Cycle 3   ",   \
  "   AR Cycle 4   ",   \
  "    AR InPro    ",   \
  " LFÑ/FAR v BI St",   \
  "   LFÑ 1 Blk    ",   \
  "   LFÑ 2 Blk    ",   \
  "    FAR Ena     ",   \
  "    FAR Blk     ",   \
  "  LFÑ 1 Start   ",   \
  "  FAR 1 Start   ",   \
  "   LFÑ/FAR 1    ",   \
  "  LFÑ 2 Start   ",   \
  "  FAR 2 Start   ",   \
  "   LFÑ/FAR 2    ",   \
  "    CBF Blk     ",   \
  " CBF v BI Start ",   \
  "   CBF Start    ",   \
  "   CBF In Op    ",   \
  "   CBF Ex Op    ",   \
  "   NSOCP Blk    ",   \
  "  NSOCP Start   ",   \
  "     NSOCP      ",   \
  "   UVP 1 Blk    ",   \
  " UVP 1 vBI Start",   \
  "   UVP 2 Blk    ",   \
  " UVP 2 vBI Start",   \
  "  UVP 1 Start   ",   \
  "   UVP 1 Vblk   ",   \
  "   UVP 1 Iblk   ",   \
  "     UVP 1      ",   \
  "  UVP 2 Start   ",   \
  "   UVP 2 Vblk   ",   \
  "   UVP 2 Iblk   ",   \
  "     UVP 2      ",   \
  "   OVP 1 Blk    ",   \
  "  OVP 1 Start   ",   \
  "     OVP 1      ",   \
  "   OVP 2 Blk    ",   \
  "  OVP 2 Start   ",   \
  "     OVP 2      ",   \
  "  MFP x Block   ",   \
  "  MFP x Start   ",   \
  "     MFP x      ",   \
  "  UD-Func 1 In  ",   \
  " UD-Func 1 Reset",   \
  " UD-Func 1 Out  ",   \
  "  UD-Func 2 In  ",   \
  " UD-Func 2 Reset",   \
  " UD-Func 2 Out  ",   \
  "  UD-Func 3 In  ",   \
  " UD-Func 3 Reset",   \
  " UD-Func 3 Out  ",   \
  "  UD-Func 4 In  ",   \
  " UD-Func 4 Reset",   \
  " UD-Func 4 Out  ",   \
  "  UD-Func 5 In  ",   \
  " UD-Func 5 Reset",   \
  " UD-Func 5 Out  ",   \
  "  UD-Func 6 In  ",   \
  " UD-Func 6 Reset",   \
  " UD-Func 6 Out  ",   \
  "  UD-Func 7 In  ",   \
  " UD-Func 7 Reset",   \
  " UD-Func 7 Out  ",   \
  "  UD-Func 8 In  ",   \
  " UD-Func 8 Reset",   \
  " UD-Func 8 Out  ",   \
  "  UD-FF 1 Set   ",   \
  " UD-FF 1 Reset  ",   \
  "  UD-FF 1 Out   ",   \
  "  UD-FF 2 Set   ",   \
  " UD-FF 2 Reset  ",   \
  "  UD-FF 2 Out   ",   \
  "  UD-FF 3 Set   ",   \
  " UD-FF 3 Reset  ",   \
  "  UD-FF 3 Out   ",   \
  "  UD-FF 4 Set   ",   \
  " UD-FF 4 Reset  ",   \
  "  UD-FF 4 Out   ",   \
  "     AND 1      ",   \
  "     AND 2      ",   \
  "     AND 3      ",   \
  "     AND 4      ",   \
  "     AND 5      ",   \
  "     AND 6      ",   \
  "     AND 7      ",   \
  "     AND 8      ",   \
  "      OR 1      ",   \
  "      OR 2      ",   \
  "      OR 3      ",   \
  "      OR 4      ",   \
  "      OR 5      ",   \
  "      OR 6      ",   \
  "      OR 7      ",   \
  "      OR 8      ",   \
  "     XOR 1      ",   \
  "     XOR 2      ",   \
  "     XOR 3      ",   \
  "     XOR 4      ",   \
  "     XOR 5      ",   \
  "     XOR 6      ",   \
  "     XOR 7      ",   \
  "     XOR 8      ",   \
  "     NOT 1      ",   \
  "     NOT 2      ",   \
  "     NOT 3      ",   \
  "     NOT 4      ",   \
  "     NOT 5      ",   \
  "     NOT 6      ",   \
  "     NOT 7      ",   \
  "     NOT 8      ",   \
  "     NOT 9      ",   \
  "     NOT 10     ",   \
  "     NOT 11     ",   \
  "     NOT 12     ",   \
  "     NOT 13     ",   \
  "     NOT 14     ",   \
  "     NOT 15     ",   \
  "     NOT 16     ",   \
  "      CF 1      ",   \
  "      CF 2      ",   \
  "      CF 3      ",   \
  "      CF 4      ",   \
  "      CF 5      ",   \
  "      CF 6      ",   \
  "      CF 7      ",   \
  "      CF 8      ",   \
  "      CF 9      ",   \
  "     CF 10      ",   \
  "     CF 11      ",   \
  "     CF 12      ",   \
  "     CF 13      ",   \
  "     CF 14      ",   \
  "     CF 15      ",   \
  "     CF 16      ",   \
  "  UD-Logic Er   "

#define NAME_RANG_KZ    \
  "  Áëîê.âêë.ÂÂ   ",   \
  " Ñáðîñ èíäèêàöèè",   \
  "   Ñáðîñ ðåëå   ",   \
  " Ìåñòí./Äèñòàíö.",   \
  "  Ïîëîæåíèå ÂÂ  ",   \
  "Îòêë.îò âí.çàùèò",   \
  "    Îòêë.ÂÂ     ",   \
  "     Âêë.ÂÂ     ",   \
  " Êîíòðîëü Îòêë. ",   \
  " Êîíòðîëü Âêë.  ",   \
  "   Ïðèâîä ÂÂ    ",   \
  " Ïðåâ.Iîò.íîì.  ",   \
  " Êðèò.Ðåñóðñ ÂÂ ",   \
  " Èñ÷.Ðåñóðñ ÂÂ  ",   \
  "  Âí.äîñòóï ÄÂõ ",   \
  "  Âí.äîñòóï ÔÊ  ",   \
  "  Âí.äîñòóï LAN ",   \
  " Âí.äîñòóï GOOSE",   \
  " Âí.äîñòóï USB  ",   \
  " Âí.äîñòóï RS485",   \
  "  Íåèñïð.Îáùàÿ  ",   \
  "  Íåèñïð.Àâàð.  ",   \
  " Ðàáîòà Àí.Ðåã. ",   \
  " Ðàáîòà Ä.Ðåã.  ",   \
  " Îòêë.îò çàùèò  ",   \
  "       ÁÎ       ",   \
  "       ÁÂ       ",   \
  "  Ãð.óñòàâîê 1  ",   \
  "  Ãð.óñòàâîê 2  ",   \
  "  Ãð.óñòàâîê 3  ",   \
  "  Ãð.óñòàâîê 4  ",   \
  " Â Ãð Óñò îò M  ",   \
  "Áëê.ãð.óñò.îò ç.",   \
  " Ñ.áëê.Ãîò.ê ÒÓ ",   \
  " Ãîòîâíîñòü ê ÒÓ",   \
  "  Èçì.íàñòðîåê  ",   \
  " Áëîê.Âõ.GOOSExx",   \
  "  Áëîê.Âõ.MMSx  ",   \
  "   Áëîê.ÂÑÁx    ",   \
  "   Áëîê.ÌÒÇ 1   ",   \
  "   Áëîê.ÌÒÇ 2   ",   \
  " Áëîê.óñê.ÌÒÇ 2 ",   \
  "   Áëîê.ÌÒÇ 3   ",   \
  "   Áëîê.ÌÒÇ 4   ",   \
  " Ñåêò.ÌÒÇÍ 1 Ïð.",   \
  "Ñåêò.ÌÒÇÍ 1 Îáð.",   \
  "    ÏÎ ÌÒÇ 1    ",   \
  " ÏÎ ÌÒÇÍ 1 Ïð.  ",   \
  " ÏÎ ÌÒÇÍ 1 Îáð. ",   \
  "  ÏÎ U ÌÒÇÏÍ 1  ",   \
  "   ÏÎ ÌÒÇÏÍ 1   ",   \
  "     ÌÒÇ 1      ",   \
  " Ñåêò.ÌÒÇÍ 2 Ïð.",   \
  "Ñåêò.ÌÒÇÍ 2 Îáð.",   \
  "    ÏÎ ÌÒÇ 2    ",   \
  " ÏÎ ÌÒÇÍ 2 Ïð.  ",   \
  " ÏÎ ÌÒÇÍ 2 Îáð. ",   \
  "  ÏÎ U ÌÒÇÏÍ 2  ",   \
  "   ÏÎ ÌÒÇÏÍ 2   ",   \
  "     ÌÒÇ 2      ",   \
  " Ñåêò.ÌÒÇÍ 3 Ïð.",   \
  "Ñåêò.ÌÒÇÍ 3 Îáð.",   \
  "    ÏÎ ÌÒÇ 3    ",   \
  " ÏÎ ÌÒÇÍ 3 Ïð.  ",   \
  " ÏÎ ÌÒÇÍ 3 Îáð. ",   \
  "  ÏÎ U ÌÒÇÏÍ 3  ",   \
  "   ÏÎ ÌÒÇÏÍ 3   ",   \
  "     ÌÒÇ 3      ",   \
  " Ñåêò.ÌÒÇÍ 4 Ïð.",   \
  "Ñåêò.ÌÒÇÍ 4 Îáð.",   \
  "    ÏÎ ÌÒÇ 4    ",   \
  " ÏÎ ÌÒÇÍ 4 Ïð.  ",   \
  " ÏÎ ÌÒÇÍ 4 Îáð. ",   \
  "  ÏÎ U ÌÒÇÏÍ 4  ",   \
  "   ÏÎ ÌÒÇÏÍ 4   ",   \
  "     ÌÒÇ 4      ",   \
  " ÏÎ áëîê.U ÌÒÇÍ ",   \
  "    ÍÖÍ-ÌÒÇ     ",   \
  "Áëîê.ÌÒÇ 0.4êÂ 1",   \
  "Áëîê.ÌÒÇ 0.4êÂ 2",   \
  "Áë.ó.ÌÒÇ 0.4êÂ 2",   \
  " ÏÎ ÌÒÇ 0.4êÂ 1 ",   \
  "  ÌÒÇ 0.4êÂ 1   ",   \
  " ÏÎ ÌÒÇ 0.4êÂ 2 ",   \
  "  ÌÒÇ 0.4êÂ 2   ",   \
  "   Áëîê.ÇÍàì    ",   \
  "    ÏÎ ÇÍàì     ",   \
  "      ÇÍàì      ",   \
  "    Áëîê.ÇÄÇ    ",   \
  " Ïóñê ÇÄÇ îò ÄÂ ",   \
  " Ñâåò ÇÄÇ îò ÄÂ ",   \
  "     ÏÎ ÇÄÇ     ",   \
  "      ÇÄÇ       ",   \
  "    Áëîê.ÍÇÇ    ",   \
  "     ÏÎ ÍÇÇ     ",   \
  "      ÍÇÇ       ",   \
  "   ÏÎ ÇÇ(3I0)   ",   \
  "    ÇÇ(3I0)     ",   \
  "   ÏÎ ÇÇ(3U0)   ",   \
  "    ÇÇ(3U0)     ",   \
  "   Ñåêòîð ÍÇÇ   ",   \
  "  Áëîê.ÒÇÍÏ 1   ",   \
  " Ñåêò.ÒÇÍÏ 1 Ïð.",   \
  "Ñåêò.ÒÇÍÏ 1 Îáð.",   \
  "ÏÎ 3I0 ÒÇÍÏ1 Ïð.",   \
  "ÏÎ 3I0 ÒÇÍÏ1 Îáð",   \
  "ÏÎ 3U0 ÒÇÍÏ1 Ïð.",   \
  "ÏÎ 3U0 ÒÇÍÏ1 Îáð",   \
  " ÏÎ ÒÇÍÏ 1 Ïð.  ",   \
  " ÏÎ ÒÇÍÏ 1 Îáð. ",   \
  "     ÒÇÍÏ 1     ",   \
  "  Áëîê.ÒÇÍÏ 2   ",   \
  " Ñåêò.ÒÇÍÏ 2 Ïð.",   \
  "Ñåêò.ÒÇÍÏ 2 Îáð.",   \
  "ÏÎ 3I0 ÒÇÍÏ2 Ïð.",   \
  "ÏÎ 3I0 ÒÇÍÏ2 Îáð",   \
  "ÏÎ 3U0 ÒÇÍÏ2 Ïð.",   \
  "ÏÎ 3U0 ÒÇÍÏ2 Îáð",   \
  " ÏÎ ÒÇÍÏ 2 Ïð.  ",   \
  " ÏÎ ÒÇÍÏ 2 Îáð. ",   \
  "     ÒÇÍÏ 2     ",   \
  "  Áëîê.ÒÇÍÏ 3   ",   \
  " Ñåêò.ÒÇÍÏ 3 Ïð.",   \
  "Ñåêò.ÒÇÍÏ 3 Îáð.",   \
  "ÏÎ 3I0 ÒÇÍÏ3 Ïð.",   \
  "ÏÎ 3I0 ÒÇÍÏ3 Îáð",   \
  "ÏÎ 3U0 ÒÇÍÏ3 Ïð.",   \
  "ÏÎ 3U0 ÒÇÍÏ3 Îáð",   \
  " ÏÎ ÒÇÍÏ 3 Ïð.  ",   \
  " ÏÎ ÒÇÍÏ 3 Îáð. ",   \
  "     ÒÇÍÏ 3     ",   \
  " Ñòàò.áëîê.ÀÏÂ  ",   \
  "      ÀÏÂ       ",   \
  "     ÀÏÂ 2      ",   \
  "     ÀÏÂ 3      ",   \
  "     ÀÏÂ 4      ",   \
  "   Ðàáîòà ÀÏÂ   ",   \
  " À×Ð/×ÀÏÂ îò ÄÂ ",   \
  "   Áëîê.À×Ð 1   ",   \
  "   Áëîê.À×Ð 2   ",   \
  "   Ðàçð.×ÀÏÂ    ",   \
  "   Áëîê.×ÀÏÂ    ",   \
  "    ÏÎ À×Ð 1    ",   \
  "   ÏÎ ×ÀÏÂ 1    ",   \
  "   À×Ð/×ÀÏÂ 1   ",   \
  "    ÏÎ À×Ð 2    ",   \
  "   ÏÎ ×ÀÏÂ 2    ",   \
  "   À×Ð/×ÀÏÂ 2   ",   \
  "   Áëîê.ÓÐÎÂ    ",   \
  " Ïóñê ÓÐÎÂ îò ÄÂ",   \
  "    ÏÎ ÓÐÎÂ     ",   \
  "     ÓÐÎÂ 1     ",   \
  "     ÓÐÎÂ 2     ",   \
  "  Áëîê.ÇÎÏ(I)   ",   \
  "   ÏÎ ÇÎÏ(I)    ",   \
  "     ÇÎÏ(I)     ",   \
  "  Áëîê.Umin 1   ",   \
  "  Ïóñê Umin 1   ",   \
  "  Áëîê.Umin 2   ",   \
  "  Ïóñê Umin 2   ",   \
  "   ÏÎ Umin 1    ",   \
  " ÏÎ Uáëê.Umin 1 ",   \
  " ÏÎ Iáëê.Umin 1 ",   \
  "     Umin 1     ",   \
  "   ÏÎ Umin 2    ",   \
  " ÏÎ Uáëê.Umin 2 ",   \
  " ÏÎ Iáëê.Umin 2 ",   \
  "     Umin 2     ",   \
  "  Áëîê.Umax 1   ",   \
  "   ÏÎ Umax 1    ",   \
  "     Umax 1     ",   \
  "  Áëîê.Umax 2   ",   \
  "   ÏÎ Umax 2    ",   \
  "     Umax 2     ",   \
  "   Áëîê.ÓÇ x    ",   \
  "    ÏÎ ÓÇ x     ",   \
  "      ÓÇ x      ",   \
  " Âõ.Î-ôóíêöèè 1 ",   \
  " Ñáð.Î-ôóíêöèè 1",   \
  " Âûõ.Î-ôóíêöèè 1",   \
  " Âõ.Î-ôóíêöèè 2 ",   \
  " Ñáð.Î-ôóíêöèè 2",   \
  " Âûõ.Î-ôóíêöèè 2",   \
  " Âõ.Î-ôóíêöèè 3 ",   \
  " Ñáð.Î-ôóíêöèè 3",   \
  " Âûõ.Î-ôóíêöèè 3",   \
  " Âõ.Î-ôóíêöèè 4 ",   \
  " Ñáð.Î-ôóíêöèè 4",   \
  " Âûõ.Î-ôóíêöèè 4",   \
  " Âõ.Î-ôóíêöèè 5 ",   \
  " Ñáð.Î-ôóíêöèè 5",   \
  " Âûõ.Î-ôóíêöèè 5",   \
  " Âõ.Î-ôóíêöèè 6 ",   \
  " Ñáð.Î-ôóíêöèè 6",   \
  " Âûõ.Î-ôóíêöèè 6",   \
  " Âõ.Î-ôóíêöèè 7 ",   \
  " Ñáð.Î-ôóíêöèè 7",   \
  " Âûõ.Î-ôóíêöèè 7",   \
  " Âõ.Î-ôóíêöèè 8 ",   \
  " Ñáð.Î-ôóíêöèè 8",   \
  " Âûõ.Î-ôóíêöèè 8",   \
  "Óñò.Î-òðèããåðà 1",   \
  "Ñáð.Î-òðèããåðà 1",   \
  "Âûõ.Î-òðèããåðà 1",   \
  "Óñò.Î-òðèããåðà 2",   \
  "Ñáð.Î-òðèããåðà 2",   \
  "Âûõ.Î-òðèããåðà 2",   \
  "Óñò.Î-òðèããåðà 3",   \
  "Ñáð.Î-òðèããåðà 3",   \
  "Âûõ.Î-òðèããåðà 3",   \
  "Óñò.Î-òðèããåðà 4",   \
  "Ñáð.Î-òðèããåðà 4",   \
  "Âûõ.Î-òðèããåðà 4",   \
  "     Î-È 1      ",   \
  "     Î-È 2      ",   \
  "     Î-È 3      ",   \
  "     Î-È 4      ",   \
  "     Î-È 5      ",   \
  "     Î-È 6      ",   \
  "     Î-È 7      ",   \
  "     Î-È 8      ",   \
  "    Î-ÈËÈ 1     ",   \
  "    Î-ÈËÈ 2     ",   \
  "    Î-ÈËÈ 3     ",   \
  "    Î-ÈËÈ 4     ",   \
  "    Î-ÈËÈ 5     ",   \
  "    Î-ÈËÈ 6     ",   \
  "    Î-ÈËÈ 7     ",   \
  "    Î-ÈËÈ 8     ",   \
  "  Î-Èñêë.ÈËÈ 1  ",   \
  "  Î-Èñêë.ÈËÈ 2  ",   \
  "  Î-Èñêë.ÈËÈ 3  ",   \
  "  Î-Èñêë.ÈËÈ 4  ",   \
  "  Î-Èñêë.ÈËÈ 5  ",   \
  "  Î-Èñêë.ÈËÈ 6  ",   \
  "  Î-Èñêë.ÈËÈ 7  ",   \
  "  Î-Èñêë.ÈËÈ 8  ",   \
  "     Î-ÍÅ 1     ",   \
  "     Î-ÍÅ 2     ",   \
  "     Î-ÍÅ 3     ",   \
  "     Î-ÍÅ 4     ",   \
  "     Î-ÍÅ 5     ",   \
  "     Î-ÍÅ 6     ",   \
  "     Î-ÍÅ 7     ",   \
  "     Î-ÍÅ 8     ",   \
  "     Î-ÍÅ 9     ",   \
  "    Î-ÍÅ 10     ",   \
  "    Î-ÍÅ 11     ",   \
  "    Î-ÍÅ 12     ",   \
  "    Î-ÍÅ 13     ",   \
  "    Î-ÍÅ 14     ",   \
  "    Î-ÍÅ 15     ",   \
  "    Î-ÍÅ 16     ",   \
  "      ÔÑ 1      ",   \
  "      ÔÑ 2      ",   \
  "      ÔÑ 3      ",   \
  "      ÔÑ 4      ",   \
  "      ÔÑ 5      ",   \
  "      ÔÑ 6      ",   \
  "      ÔÑ 7      ",   \
  "      ÔÑ 8      ",   \
  "      ÔÑ 9      ",   \
  "     ÔÑ 10      ",   \
  "     ÔÑ 11      ",   \
  "     ÔÑ 12      ",   \
  "     ÔÑ 13      ",   \
  "     ÔÑ 14      ",   \
  "     ÔÑ 15      ",   \
  "     ÔÑ 16      ",   \
  " Îø.íàñòð.ð.ëîã."
    
#endif 
