#ifndef __CONSTANTS_OUTPUTS__
#define __CONSTANTS_OUTPUTS__

#define EKRAN_LIST_OUTPUTS_FOR_RANGUVANNJA        (EKRAN_LIST_INPUTS_FOR_RANGUVANNJA + 1)

#define EKRAN_RANGUVANNJA_OUTPUT_1                (EKRAN_RANGUVANNJA_INPUT_LAST + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_2                (EKRAN_RANGUVANNJA_OUTPUT_1 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_3                (EKRAN_RANGUVANNJA_OUTPUT_2 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_4                (EKRAN_RANGUVANNJA_OUTPUT_3 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_5                (EKRAN_RANGUVANNJA_OUTPUT_4 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_6                (EKRAN_RANGUVANNJA_OUTPUT_5 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_7                (EKRAN_RANGUVANNJA_OUTPUT_6 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_8                (EKRAN_RANGUVANNJA_OUTPUT_7 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_9                (EKRAN_RANGUVANNJA_OUTPUT_8 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_10               (EKRAN_RANGUVANNJA_OUTPUT_9 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_11               (EKRAN_RANGUVANNJA_OUTPUT_10 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_12               (EKRAN_RANGUVANNJA_OUTPUT_11 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_13               (EKRAN_RANGUVANNJA_OUTPUT_12 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_14               (EKRAN_RANGUVANNJA_OUTPUT_13 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_15               (EKRAN_RANGUVANNJA_OUTPUT_14 + 1)
#define EKRAN_RANGUVANNJA_OUTPUT_16               (EKRAN_RANGUVANNJA_OUTPUT_15 + 1)

#define EKRAN_RANGUVANNJA_OUTPUT_LAST             EKRAN_RANGUVANNJA_OUTPUT_16

#define MAX_ROW_LIST_OUTPUTS_FOR_RANGUVANNJA       NUMBER_SIMPLE_OUTPUTS
#define MAX_ROW_RANGUVANNJA_OUTPUT                 NUMBER_TOTAL_SIGNAL_FOR_RANG

#define NAME_RANG_RU    \
  "  Блок.вкл.ВВ   ",   \
  " Сброс индикации",   \
  "   Сброс реле   ",   \
  " Местн./Дистанц.",   \
  "  Положение ВВ  ",   \
  "Откл.от вн.защит",   \
  "    Откл.ВВ     ",   \
  "     Вкл.ВВ     ",   \
  " Контроль Откл. ",   \
  " Контроль Вкл.  ",   \
  "   Привод ВВ    ",   \
  " Прев.Iот.ном.  ",   \
  " Крит.Ресурс ВВ ",   \
  " Исч.Ресурс ВВ  ",   \
  "  Вн.доступ ДВх ",   \
  "  Вн.доступ ФК  ",   \
  "  Вн.доступ USB ",   \
  " Вн.доступ RS485",   \
  "  Неиспр.Общая  ",   \
  "  Неиспр.Авар.  ",   \
  " Работа Ан.Рег. ",   \
  " Работа Д.Рег.  ",   \
  " Откл.от защит  ",   \
  "       БО       ",   \
  "       БВ       ",   \
  "  Гр.уставок 1  ",   \
  "  Гр.уставок 2  ",   \
  "  Гр.уставок 3  ",   \
  "  Гр.уставок 4  ",   \
  " В Гр Уст от М  ",   \
  "Блк.гр.уст.от з.",   \
  " С.блк.Гот.к ТУ ",   \
  " Готовность к ТУ",   \
  "  Изм.настроек  ",   \
  "   Блок.МТЗ 1   ",   \
  "   Блок.МТЗ 2   ",   \
  " Блок.уск.МТЗ 2 ",   \
  "   Блок.МТЗ 3   ",   \
  "   Блок.МТЗ 4   ",   \
  " Сект.МТЗН 1 Пр.",   \
  "Сект.МТЗН 1 Обр.",   \
  "    ПО МТЗ 1    ",   \
  " ПО МТЗН 1 Пр.  ",   \
  " ПО МТЗН 1 Обр. ",   \
  "  ПО U МТЗПН 1  ",   \
  "   ПО МТЗПН 1   ",   \
  "     МТЗ 1      ",   \
  " Сект.МТЗН 2 Пр.",   \
  "Сект.МТЗН 2 Обр.",   \
  "    ПО МТЗ 2    ",   \
  " ПО МТЗН 2 Пр.  ",   \
  " ПО МТЗН 2 Обр. ",   \
  "  ПО U МТЗПН 2  ",   \
  "   ПО МТЗПН 2   ",   \
  "     МТЗ 2      ",   \
  " Сект.МТЗН 3 Пр.",   \
  "Сект.МТЗН 3 Обр.",   \
  "    ПО МТЗ 3    ",   \
  " ПО МТЗН 3 Пр.  ",   \
  " ПО МТЗН 3 Обр. ",   \
  "  ПО U МТЗПН 3  ",   \
  "   ПО МТЗПН 3   ",   \
  "     МТЗ 3      ",   \
  " Сект.МТЗН 4 Пр.",   \
  "Сект.МТЗН 4 Обр.",   \
  "    ПО МТЗ 4    ",   \
  " ПО МТЗН 4 Пр.  ",   \
  " ПО МТЗН 4 Обр. ",   \
  "  ПО U МТЗПН 4  ",   \
  "   ПО МТЗПН 4   ",   \
  "     МТЗ 4      ",   \
  " ПО блок.U МТЗН ",   \
  "    НЦН-МТЗ     ",   \
  "Блок.МТЗ 0.4кВ 1",   \
  "Блок.МТЗ 0.4кВ 2",   \
  "Бл.у.МТЗ 0.4кВ 2",   \
  " ПО МТЗ 0.4кВ 1 ",   \
  "  МТЗ 0.4кВ 1   ",   \
  " ПО МТЗ 0.4кВ 2 ",   \
  "  МТЗ 0.4кВ 2   ",   \
  "   Блок.ЗНам    ",   \
  "    ПО ЗНам     ",   \
  "      ЗНам      ",   \
  "    Блок.ЗДЗ    ",   \
  " Пуск ЗДЗ от ДВ ",   \
  " Свет ЗДЗ от ДВ ",   \
  "Свет ЗДЗ от ОВД1",   \
  "Свет ЗДЗ от ОВД2",   \
  "Свет ЗДЗ от ОВД3",   \
  "Свет ЗДЗ от ОВД4",   \
  "     ПО ЗДЗ     ",   \
  "      ЗДЗ       ",   \
  "    Блок.НЗЗ    ",   \
  "     ПО НЗЗ     ",   \
  "      НЗЗ       ",   \
  "   ПО ЗЗ(3I0)   ",   \
  "    ЗЗ(3I0)     ",   \
  "   ПО ЗЗ(3U0)   ",   \
  "    ЗЗ(3U0)     ",   \
  "   Сектор НЗЗ   ",   \
  "  Блок.ТЗНП 1   ",   \
  " Сект.ТЗНП 1 Пр.",   \
  "Сект.ТЗНП 1 Обр.",   \
  "ПО 3I0 ТЗНП1 Пр.",   \
  "ПО 3I0 ТЗНП1 Обр",   \
  "ПО 3U0 ТЗНП1 Пр.",   \
  "ПО 3U0 ТЗНП1 Обр",   \
  " ПО ТЗНП 1 Пр.  ",   \
  " ПО ТЗНП 1 Обр. ",   \
  "     ТЗНП 1     ",   \
  "  Блок.ТЗНП 2   ",   \
  " Сект.ТЗНП 2 Пр.",   \
  "Сект.ТЗНП 2 Обр.",   \
  "ПО 3I0 ТЗНП2 Пр.",   \
  "ПО 3I0 ТЗНП2 Обр",   \
  "ПО 3U0 ТЗНП2 Пр.",   \
  "ПО 3U0 ТЗНП2 Обр",   \
  " ПО ТЗНП 2 Пр.  ",   \
  " ПО ТЗНП 2 Обр. ",   \
  "     ТЗНП 2     ",   \
  "  Блок.ТЗНП 3   ",   \
  " Сект.ТЗНП 3 Пр.",   \
  "Сект.ТЗНП 3 Обр.",   \
  "ПО 3I0 ТЗНП3 Пр.",   \
  "ПО 3I0 ТЗНП3 Обр",   \
  "ПО 3U0 ТЗНП3 Пр.",   \
  "ПО 3U0 ТЗНП3 Обр",   \
  " ПО ТЗНП 3 Пр.  ",   \
  " ПО ТЗНП 3 Обр. ",   \
  "     ТЗНП 3     ",   \
  " Стат.блок.АПВ  ",   \
  "      АПВ       ",   \
  "     АПВ 2      ",   \
  "     АПВ 3      ",   \
  "     АПВ 4      ",   \
  "   Работа АПВ   ",   \
  " АЧР/ЧАПВ от ДВ ",   \
  "   Блок.АЧР 1   ",   \
  "   Блок.АЧР 2   ",   \
  "   Разр.ЧАПВ    ",   \
  "   Блок.ЧАПВ    ",   \
  "    ПО АЧР 1    ",   \
  "   ПО ЧАПВ 1    ",   \
  "   АЧР/ЧАПВ 1   ",   \
  "    ПО АЧР 2    ",   \
  "   ПО ЧАПВ 2    ",   \
  "   АЧР/ЧАПВ 2   ",   \
  "   Блок.УРОВ    ",   \
  " Пуск УРОВ от ДВ",   \
  "    ПО УРОВ     ",   \
  "     УРОВ 1     ",   \
  "     УРОВ 2     ",   \
  "  Блок.ЗОП(I)   ",   \
  "   ПО ЗОП(I)    ",   \
  "     ЗОП(I)     ",   \
  "  Блок.Umin 1   ",   \
  "  Пуск Umin 1   ",   \
  "  Блок.Umin 2   ",   \
  "  Пуск Umin 2   ",   \
  "   ПО Umin 1    ",   \
  " ПО Uблк.Umin 1 ",   \
  " ПО Iблк.Umin 1 ",   \
  "     Umin 1     ",   \
  "   ПО Umin 2    ",   \
  " ПО Uблк.Umin 2 ",   \
  " ПО Iблк.Umin 2 ",   \
  "     Umin 2     ",   \
  "  Блок.Umax 1   ",   \
  "   ПО Umax 1    ",   \
  "     Umax 1     ",   \
  "  Блок.Umax 2   ",   \
  "   ПО Umax 2    ",   \
  "     Umax 2     ",   \
  "   Блок.УЗ x    ",   \
  "    ПО УЗ x     ",   \
  "      УЗ x      ",   \
  " Вх.О-функции 1 ",   \
  " Сбр.О-функции 1",   \
  " Вых.О-функции 1",   \
  " Вх.О-функции 2 ",   \
  " Сбр.О-функции 2",   \
  " Вых.О-функции 2",   \
  " Вх.О-функции 3 ",   \
  " Сбр.О-функции 3",   \
  " Вых.О-функции 3",   \
  " Вх.О-функции 4 ",   \
  " Сбр.О-функции 4",   \
  " Вых.О-функции 4",   \
  " Вх.О-функции 5 ",   \
  " Сбр.О-функции 5",   \
  " Вых.О-функции 5",   \
  " Вх.О-функции 6 ",   \
  " Сбр.О-функции 6",   \
  " Вых.О-функции 6",   \
  " Вх.О-функции 7 ",   \
  " Сбр.О-функции 7",   \
  " Вых.О-функции 7",   \
  " Вх.О-функции 8 ",   \
  " Сбр.О-функции 8",   \
  " Вых.О-функции 8",   \
  "Уст.О-триггера 1",   \
  "Сбр.О-триггера 1",   \
  "Вых.О-триггера 1",   \
  "Уст.О-триггера 2",   \
  "Сбр.О-триггера 2",   \
  "Вых.О-триггера 2",   \
  "Уст.О-триггера 3",   \
  "Сбр.О-триггера 3",   \
  "Вых.О-триггера 3",   \
  "Уст.О-триггера 4",   \
  "Сбр.О-триггера 4",   \
  "Вых.О-триггера 4",   \
  "     О-И 1      ",   \
  "     О-И 2      ",   \
  "     О-И 3      ",   \
  "     О-И 4      ",   \
  "     О-И 5      ",   \
  "     О-И 6      ",   \
  "     О-И 7      ",   \
  "     О-И 8      ",   \
  "    О-ИЛИ 1     ",   \
  "    О-ИЛИ 2     ",   \
  "    О-ИЛИ 3     ",   \
  "    О-ИЛИ 4     ",   \
  "    О-ИЛИ 5     ",   \
  "    О-ИЛИ 6     ",   \
  "    О-ИЛИ 7     ",   \
  "    О-ИЛИ 8     ",   \
  "  О-Искл.ИЛИ 1  ",   \
  "  О-Искл.ИЛИ 2  ",   \
  "  О-Искл.ИЛИ 3  ",   \
  "  О-Искл.ИЛИ 4  ",   \
  "  О-Искл.ИЛИ 5  ",   \
  "  О-Искл.ИЛИ 6  ",   \
  "  О-Искл.ИЛИ 7  ",   \
  "  О-Искл.ИЛИ 8  ",   \
  "     О-НЕ 1     ",   \
  "     О-НЕ 2     ",   \
  "     О-НЕ 3     ",   \
  "     О-НЕ 4     ",   \
  "     О-НЕ 5     ",   \
  "     О-НЕ 6     ",   \
  "     О-НЕ 7     ",   \
  "     О-НЕ 8     ",   \
  "     О-НЕ 9     ",   \
  "    О-НЕ 10     ",   \
  "    О-НЕ 11     ",   \
  "    О-НЕ 12     ",   \
  "    О-НЕ 13     ",   \
  "    О-НЕ 14     ",   \
  "    О-НЕ 15     ",   \
  "    О-НЕ 16     ",   \
  "      ФС 1      ",   \
  "      ФС 2      ",   \
  "      ФС 3      ",   \
  "      ФС 4      ",   \
  "      ФС 5      ",   \
  "      ФС 6      ",   \
  "      ФС 7      ",   \
  "      ФС 8      ",   \
  "      ФС 9      ",   \
  "     ФС 10      ",   \
  "     ФС 11      ",   \
  "     ФС 12      ",   \
  "     ФС 13      ",   \
  "     ФС 14      ",   \
  "     ФС 15      ",   \
  "     ФС 16      ",   \
  " Ош.настр.р.лог."

#define NAME_RANG_UA    \
  " Блок.увімкн.ВВ ",   \
  " Скид.індикації ",   \
  "   Скид.реле    ",   \
  " Місц./Дистанц. ",   \
  "    Стан ВВ     ",   \
  "Вимк.від зовн.з.",   \
  "    Вимк.ВВ     ",   \
  "    Увімк.ВВ    ",   \
  " Контроль Вимк. ",   \
  " Контроль Увімк.",   \
  "   Привід ВВ    ",   \
  " Перев.Iв.ном.  ",   \
  " Крит.Ресурс ВВ ",   \
  " Вич.Ресурс ВВ  ",   \
  " Зовн.дост.ДВх  ",   \
  "  Зовн.дост.ФК  ",   \
  " Зовн.дост.USB  ",   \
  " Зовн.дост.RS485",   \
  " Неспр.Загальна ",   \
  "  Неспр.Авар.   ",   \
  " Роб.Ан.Реєстр. ",   \
  " Роб.Д.Реєстр.  ",   \
  " Вимк.від зах.  ",   \
  "     БВимк.     ",   \
  "    БУвімк.     ",   \
  "  Гр.уставок 1  ",   \
  "  Гр.уставок 2  ",   \
  "  Гр.уставок 3  ",   \
  "  Гр.уставок 4  ",   \
  " В Гр Уст від М ",   \
  "Бл.гр.уст.від з.",   \
  " С.блк.Гот.до ТУ",   \
  "Готовність до ТУ",   \
  " Зм.налаштування",   \
  "   Блок.МСЗ 1   ",   \
  "   Блок.МСЗ 2   ",   \
  "Блок.приск.МСЗ 2",   \
  "   Блок.МСЗ 3   ",   \
  "   Блок.МСЗ 4   ",   \
  " Сект.МСЗС 1 Пр.",   \
  " Сект.МСЗС 1 Зв.",   \
  "    ПО МСЗ 1    ",   \
  " ПО МСЗС 1 Пр.  ",   \
  " ПО МСЗС 1 Зв.  ",   \
  "  ПО U МСЗПН 1  ",   \
  "   ПО МСЗПН 1   ",   \
  "     МСЗ 1      ",   \
  " Сект.МСЗС 2 Пр.",   \
  " Сект.МСЗС 2 Зв.",   \
  "    ПО МСЗ 2    ",   \
  " ПО МСЗС 2 Пр.  ",   \
  " ПО МСЗС 2 Зв.  ",   \
  "  ПО U МСЗПН 2  ",   \
  "   ПО МСЗПН 2   ",   \
  "     МСЗ 2      ",   \
  " Сект.МСЗС 3 Пр.",   \
  " Сект.МСЗС 3 Зв.",   \
  "    ПО МСЗ 3    ",   \
  " ПО МСЗС 3 Пр.  ",   \
  " ПО МСЗС 3 Зв.  ",   \
  "  ПО U МСЗПН 3  ",   \
  "   ПО МСЗПН 3   ",   \
  "     МСЗ 3      ",   \
  " Сект.МСЗС 4 Пр.",   \
  " Сект.МСЗС 4 Зв.",   \
  "    ПО МСЗ 4    ",   \
  " ПО МСЗС 4 Пр.  ",   \
  " ПО МСЗС 4 Зв.  ",   \
  "  ПО U МСЗПН 4  ",   \
  "   ПО МСЗПН 4   ",   \
  "     МСЗ 4      ",   \
  " ПО блок.U МСЗС ",   \
  "    НКН-МСЗ     ",   \
  "Блок.МСЗ 0.4кВ 1",   \
  "Блок.МСЗ 0.4кВ 2",   \
  "Бл.п.МСЗ 0.4кВ 2",   \
  " ПО МСЗ 0.4кВ 1 ",   \
  "  МСЗ 0.4кВ 1   ",   \
  " ПО МСЗ 0.4кВ 2 ",   \
  "  МСЗ 0.4кВ 2   ",   \
  "   Блок.ЗНам    ",   \
  "    ПО ЗНам     ",   \
  "      ЗНам      ",   \
  "    Блок.ЗДЗ    ",   \
  " Пуск ЗДЗ від ДВ",   \
  " Св.ЗДЗ від ДВ  ",   \
  " Св.ЗДЗ від ОВД1",   \
  " Св.ЗДЗ від ОВД2",   \
  " Св.ЗДЗ від ОВД3",   \
  " Св.ЗДЗ від ОВД4",   \
  "     ПО ЗДЗ     ",   \
  "      ЗДЗ       ",   \
  "    Блок.СЗЗ    ",   \
  "     ПО СЗЗ     ",   \
  "      СЗЗ       ",   \
  "   ПО ЗЗ(3I0)   ",   \
  "    ЗЗ(3I0)     ",   \
  "   ПО ЗЗ(3U0)   ",   \
  "    ЗЗ(3U0)     ",   \
  "   Сектор СЗЗ   ",   \
  "  Блок.СЗНП 1   ",   \
  " Сект.СЗНП 1 Пр.",   \
  " Сект.СЗНП 1 Зв.",   \
  "ПО 3I0 СЗНП1 Пр.",   \
  "ПО 3I0 СЗНП1 Зв.",   \
  "ПО 3U0 СЗНП1 Пр.",   \
  "ПО 3U0 СЗНП1 Зв.",   \
  " ПО СЗНП 1 Пр.  ",   \
  " ПО СЗНП 1 Зв.  ",   \
  "     СЗНП 1     ",   \
  "  Блок.СЗНП 2   ",   \
  " Сект.СЗНП 2 Пр.",   \
  " Сект.СЗНП 2 Зв.",   \
  "ПО 3I0 СЗНП2 Пр.",   \
  "ПО 3I0 СЗНП2 Зв.",   \
  "ПО 3U0 СЗНП2 Пр.",   \
  "ПО 3U0 СЗНП2 Зв.",   \
  " ПО СЗНП 2 Пр.  ",   \
  " ПО СЗНП 2 Зв.  ",   \
  "     СЗНП 2     ",   \
  "  Блок.СЗНП 3   ",   \
  " Сект.СЗНП 3 Пр.",   \
  " Сект.СЗНП 3 Зв.",   \
  "ПО 3I0 СЗНП3 Пр.",   \
  "ПО 3I0 СЗНП3 Зв.",   \
  "ПО 3U0 СЗНП3 Пр.",   \
  "ПО 3U0 СЗНП3 Зв.",   \
  " ПО СЗНП 3 Пр.  ",   \
  " ПО СЗНП 3 Зв.  ",   \
  "     СЗНП 3     ",   \
  " Стат.блок.АПВ  ",   \
  "      АПВ       ",   \
  "     АПВ 2      ",   \
  "     АПВ 3      ",   \
  "     АПВ 4      ",   \
  "   Робота АПВ   ",   \
  " АЧР/ЧАПВ від ДВ",   \
  "   Блок.АЧР 1   ",   \
  "   Блок.АЧР 2   ",   \
  "  Дозвіл ЧАПВ   ",   \
  "   Блок.ЧАПВ    ",   \
  "    ПО АЧР 1    ",   \
  "   ПО ЧАПВ 1    ",   \
  "   АЧР/ЧАПВ 1   ",   \
  "    ПО АЧР 2    ",   \
  "   ПО ЧАПВ 2    ",   \
  "   АЧР/ЧАПВ 2   ",   \
  "   Блок.ПРВВ    ",   \
  "Пуск ПРВВ від ДВ",   \
  "    ПО ПРВВ     ",   \
  "     ПРВВ 1     ",   \
  "     ПРВВ 2     ",   \
  "  Блок.ЗЗП(I)   ",   \
  "   ПО ЗЗП(I)    ",   \
  "     ЗЗП(I)     ",   \
  "  Блок.Umin 1   ",   \
  "  Пуск Umin 1   ",   \
  "  Блок.Umin 2   ",   \
  "  Пуск Umin 2   ",   \
  "   ПО Umin 1    ",   \
  " ПО Uблк.Umin 1 ",   \
  " ПО Iблк.Umin 1 ",   \
  "     Umin 1     ",   \
  "   ПО Umin 2    ",   \
  " ПО Uблк.Umin 2 ",   \
  " ПО Iблк.Umin 2 ",   \
  "     Umin 2     ",   \
  "  Блок.Umax 1   ",   \
  "   ПО Umax 1    ",   \
  "     Umax 1     ",   \
  "  Блок.Umax 2   ",   \
  "   ПО Umax 2    ",   \
  "     Umax 2     ",   \
  "   Блок.УЗ x    ",   \
  "    ПО УЗ x     ",   \
  "      УЗ x      ",   \
  " Вх.В-функції 1 ",   \
  " Ск.В-функції 1 ",   \
  " Вих.В-функції 1",   \
  " Вх.В-функції 2 ",   \
  " Ск.В-функції 2 ",   \
  " Вих.В-функції 2",   \
  " Вх.В-функції 3 ",   \
  " Ск.В-функції 3 ",   \
  " Вих.В-функції 3",   \
  " Вх.В-функції 4 ",   \
  " Ск.В-функції 4 ",   \
  " Вих.В-функції 4",   \
  " Вх.В-функції 5 ",   \
  " Ск.В-функції 5 ",   \
  " Вих.В-функції 5",   \
  " Вх.В-функції 6 ",   \
  " Ск.В-функції 6 ",   \
  " Вих.В-функції 6",   \
  " Вх.В-функції 7 ",   \
  " Ск.В-функції 7 ",   \
  " Вих.В-функції 7",   \
  " Вх.В-функції 8 ",   \
  " Ск.В-функції 8 ",   \
  " Вих.В-функції 8",   \
  " Вст.В-триґера 1",   \
  " Ск.В-триґера 1 ",   \
  " Вих.В-триґера 1",   \
  " Вст.В-триґера 2",   \
  " Ск.В-триґера 2 ",   \
  " Вих.В-триґера 2",   \
  " Вст.В-триґера 3",   \
  " Ск.В-триґера 3 ",   \
  " Вих.В-триґера 3",   \
  " Вст.В-триґера 4",   \
  " Ск.В-триґера 4 ",   \
  " Вих.В-триґера 4",   \
  "     В-І 1      ",   \
  "     В-І 2      ",   \
  "     В-І 3      ",   \
  "     В-І 4      ",   \
  "     В-І 5      ",   \
  "     В-І 6      ",   \
  "     В-І 7      ",   \
  "     В-І 8      ",   \
  "    В-АБО 1     ",   \
  "    В-АБО 2     ",   \
  "    В-АБО 3     ",   \
  "    В-АБО 4     ",   \
  "    В-АБО 5     ",   \
  "    В-АБО 6     ",   \
  "    В-АБО 7     ",   \
  "    В-АБО 8     ",   \
  "  В-Викл.АБО 1  ",   \
  "  В-Викл.АБО 2  ",   \
  "  В-Викл.АБО 3  ",   \
  "  В-Викл.АБО 4  ",   \
  "  В-Викл.АБО 5  ",   \
  "  В-Викл.АБО 6  ",   \
  "  В-Викл.АБО 7  ",   \
  "  В-Викл.АБО 8  ",   \
  "     В-НЕ 1     ",   \
  "     В-НЕ 2     ",   \
  "     В-НЕ 3     ",   \
  "     В-НЕ 4     ",   \
  "     В-НЕ 5     ",   \
  "     В-НЕ 6     ",   \
  "     В-НЕ 7     ",   \
  "     В-НЕ 8     ",   \
  "     В-НЕ 9     ",   \
  "     В-НЕ 10    ",   \
  "     В-НЕ 11    ",   \
  "     В-НЕ 12    ",   \
  "     В-НЕ 13    ",   \
  "     В-НЕ 14    ",   \
  "     В-НЕ 15    ",   \
  "     В-НЕ 16    ",   \
  "      ФЗ 1      ",   \
  "      ФЗ 2      ",   \
  "      ФЗ 3      ",   \
  "      ФЗ 4      ",   \
  "      ФЗ 5      ",   \
  "      ФЗ 6      ",   \
  "      ФЗ 7      ",   \
  "      ФЗ 8      ",   \
  "      ФЗ 9      ",   \
  "     ФЗ 10      ",   \
  "     ФЗ 11      ",   \
  "     ФЗ 12      ",   \
  "     ФЗ 13      ",   \
  "     ФЗ 14      ",   \
  "     ФЗ 15      ",   \
  "     ФЗ 16      ",   \
  " Пом.нал.р.лог. "
    
#define NAME_RANG_EN    \
  "  CB Close Blk  ",   \
  "   LED Reset    ",   \
  "  Relay Reset   ",   \
  "  Local/Remote  ",   \
  "    CB State    ",   \
  " Ext CB Open Cmd",   \
  "  Open CB Cmd   ",   \
  "  Close CB Cmd  ",   \
  "  Open CB Ctl   ",   \
  " Closing CB Ctl ",   \
  "  CB Actuator   ",   \
  "Rat Trip Cur Exc",   \
  "  CB Crit Res   ",   \
  "   CB Res Exh   ",   \
  " Ext Acc via BI ",   \
  " Ext Acc via UDK",   \
  " Ext Acc via USB",   \
  "Ext Ac via RS485",   \
  " General Fault  ",   \
  " Emergence Fault",   \
  " Dst Rec InPro  ",   \
  " Bin Rec InPro  ",   \
  " Trip via Prot  ",   \
  "  Open CB Com   ",   \
  "  Close CB Com  ",   \
  " SetPoints Gr-1 ",   \
  " SetPoints Gr-2 ",   \
  " SetPoints Gr-3 ",   \
  " SetPoints Gr-4 ",   \
  " SP Gr Ch via M ",   \
  "SP Gr Chg BI v P",   \
  "Rem Ctr R Bl Res",   \
  "  Rem Ctl Ena   ",   \
  " Settings Change",   \
  "   OCP 1 Blk    ",   \
  "   OCP 2 Blk    ",   \
  " OCP 2 Acc Blk  ",   \
  "   OCP 3 Blk    ",   \
  "   OCP 4 Blk    ",   \
  " DOCP 1 Fw Sec  ",   \
  " DOCP 1 Bw Sec  ",   \
  "  OCP 1 Start   ",   \
  " DOCP 1 Fw Start",   \
  " DOCP 1 Bw Start",   \
  " VOCP 1 V Start ",   \
  "  VOCP 1 Start  ",   \
  "     OCP 1      ",   \
  " DOCP 2 Fw Sec  ",   \
  " DOCP 2 Bw Sec  ",   \
  "  OCP 2 Start   ",   \
  " DOCP 2 Fw Start",   \
  " DOCP 2 Bw Start",   \
  " VOCP 2 V Start ",   \
  "  VOCP 2 Start  ",   \
  "     OCP 2      ",   \
  " DOCP 3 Fw Sec  ",   \
  " DOCP 3 Bw Sec  ",   \
  "  OCP 3 Start   ",   \
  " DOCP 3 Fw Start",   \
  " DOCP 3 Bw Start",   \
  " VOCP 3 V Start ",   \
  "  VOCP 3 Start  ",   \
  "     OCP 3      ",   \
  " DOCP 4 Fw Sec  ",   \
  " DOCP 4 Bw Sec  ",   \
  "  OCP 4 Start   ",   \
  " DOCP 4 Fw Start",   \
  " DOCP 4 Bw Start",   \
  " VOCP 4 V Start ",   \
  "  VOCP 4 Start  ",   \
  "     OCP 4      ",   \
  "   OCP V Blk    ",   \
  "    OCP VCM     ",   \
  "  LVOCP 1 Blk   ",   \
  "  LVOCP 2 Blk   ",   \
  " LVOCP 2 acc Blk",   \
  " LVOCP 1 Start  ",   \
  "    LVOCP 1     ",   \
  " LVOCP 2 Start  ",   \
  "    LVOCP 2     ",   \
  "    InrP Blk    ",   \
  "   InrP Start   ",   \
  "      InrP      ",   \
  "    AFD Blk     ",   \
  "AFD via BI Start",   \
  " AFD via BI St  ",   \
  " AFD via LS1 St ",   \
  " AFD via LS2 St ",   \
  " AFD via LS3 St ",   \
  " AFD via LS4 St ",   \
  "   AFD Start    ",   \
  "      AFD       ",   \
  "   SDEFP Blk    ",   \
  "  SDEFP Start   ",   \
  "     SDEFP      ",   \
  "  SEFOCP Start  ",   \
  "     SEFOCP     ",   \
  "  EFOVP Start   ",   \
  "     EFOVP      ",   \
  "   SDEFP Sec    ",   \
  "   DEFP 1 Blk   ",   \
  " DEFP 1 Sec Fw  ",   \
  " DEFP 1 Sec Bw  ",   \
  "DEFP 1 3I0 Fw St",   \
  "DEFP 1 3I0 Bw St",   \
  "DEFP 1 3V0 Fw St",   \
  "DEFP 1 3V0 Bw St",   \
  "  DEFP 1 Fw St  ",   \
  "  DEFP 1 Bw St  ",   \
  "     DEFP 1     ",   \
  "   DEFP 2 Blk   ",   \
  " DEFP 2 Sec Fw  ",   \
  " DEFP 2 Sec Bw  ",   \
  "DEFP 2 3I0 Fw St",   \
  "DEFP 2 3I0 Bw St",   \
  "DEFP 2 3V0 Fw St",   \
  "DEFP 2 3V0 Bw St",   \
  "  DEFP 2 Fw St  ",   \
  "  DEFP 2 Bw St  ",   \
  "     DEFP 2     ",   \
  "   DEFP 3 Blk   ",   \
  " DEFP 3 Sec Fw  ",   \
  " DEFP 3 Sec Bw  ",   \
  "DEFP 3 3I0 Fw St",   \
  "DEFP 3 3I0 Bw St",   \
  "DEFP 3 3V0 Fw St",   \
  "DEFP 3 3V0 Bw St",   \
  "  DEFP 3 Fw St  ",   \
  "  DEFP 3 Bw St  ",   \
  "     DEFP 3     ",   \
  "     AR Blk     ",   \
  "   AR Cycle 1   ",   \
  "   AR Cycle 2   ",   \
  "   AR Cycle 3   ",   \
  "   AR Cycle 4   ",   \
  "    AR InPro    ",   \
  " LFС/FAR v BI St",   \
  "   LFС 1 Blk    ",   \
  "   LFС 2 Blk    ",   \
  "    FAR Ena     ",   \
  "    FAR Blk     ",   \
  "  LFС 1 Start   ",   \
  "  FAR 1 Start   ",   \
  "   LFС/FAR 1    ",   \
  "  LFС 2 Start   ",   \
  "  FAR 2 Start   ",   \
  "   LFС/FAR 2    ",   \
  "    CBF Blk     ",   \
  " CBF v BI Start ",   \
  "   CBF Start    ",   \
  "   CBF In Op    ",   \
  "   CBF Ex Op    ",   \
  "   NSOCP Blk    ",   \
  "  NSOCP Start   ",   \
  "     NSOCP      ",   \
  "   UVP 1 Blk    ",   \
  " UVP 1 vBI Start",   \
  "   UVP 2 Blk    ",   \
  " UVP 2 vBI Start",   \
  "  UVP 1 Start   ",   \
  "   UVP 1 Vblk   ",   \
  "   UVP 1 Iblk   ",   \
  "     UVP 1      ",   \
  "  UVP 2 Start   ",   \
  "   UVP 2 Vblk   ",   \
  "   UVP 2 Iblk   ",   \
  "     UVP 2      ",   \
  "   OVP 1 Blk    ",   \
  "  OVP 1 Start   ",   \
  "     OVP 1      ",   \
  "   OVP 2 Blk    ",   \
  "  OVP 2 Start   ",   \
  "     OVP 2      ",   \
  "  MFP x Block   ",   \
  "  MFP x Start   ",   \
  "     MFP x      ",   \
  "  UD-Func 1 In  ",   \
  " UD-Func 1 Reset",   \
  " UD-Func 1 Out  ",   \
  "  UD-Func 2 In  ",   \
  " UD-Func 2 Reset",   \
  " UD-Func 2 Out  ",   \
  "  UD-Func 3 In  ",   \
  " UD-Func 3 Reset",   \
  " UD-Func 3 Out  ",   \
  "  UD-Func 4 In  ",   \
  " UD-Func 4 Reset",   \
  " UD-Func 4 Out  ",   \
  "  UD-Func 5 In  ",   \
  " UD-Func 5 Reset",   \
  " UD-Func 5 Out  ",   \
  "  UD-Func 6 In  ",   \
  " UD-Func 6 Reset",   \
  " UD-Func 6 Out  ",   \
  "  UD-Func 7 In  ",   \
  " UD-Func 7 Reset",   \
  " UD-Func 7 Out  ",   \
  "  UD-Func 8 In  ",   \
  " UD-Func 8 Reset",   \
  " UD-Func 8 Out  ",   \
  "  UD-FF 1 Set   ",   \
  " UD-FF 1 Reset  ",   \
  "  UD-FF 1 Out   ",   \
  "  UD-FF 2 Set   ",   \
  " UD-FF 2 Reset  ",   \
  "  UD-FF 2 Out   ",   \
  "  UD-FF 3 Set   ",   \
  " UD-FF 3 Reset  ",   \
  "  UD-FF 3 Out   ",   \
  "  UD-FF 4 Set   ",   \
  " UD-FF 4 Reset  ",   \
  "  UD-FF 4 Out   ",   \
  "     AND 1      ",   \
  "     AND 2      ",   \
  "     AND 3      ",   \
  "     AND 4      ",   \
  "     AND 5      ",   \
  "     AND 6      ",   \
  "     AND 7      ",   \
  "     AND 8      ",   \
  "      OR 1      ",   \
  "      OR 2      ",   \
  "      OR 3      ",   \
  "      OR 4      ",   \
  "      OR 5      ",   \
  "      OR 6      ",   \
  "      OR 7      ",   \
  "      OR 8      ",   \
  "     XOR 1      ",   \
  "     XOR 2      ",   \
  "     XOR 3      ",   \
  "     XOR 4      ",   \
  "     XOR 5      ",   \
  "     XOR 6      ",   \
  "     XOR 7      ",   \
  "     XOR 8      ",   \
  "     NOT 1      ",   \
  "     NOT 2      ",   \
  "     NOT 3      ",   \
  "     NOT 4      ",   \
  "     NOT 5      ",   \
  "     NOT 6      ",   \
  "     NOT 7      ",   \
  "     NOT 8      ",   \
  "     NOT 9      ",   \
  "     NOT 10     ",   \
  "     NOT 11     ",   \
  "     NOT 12     ",   \
  "     NOT 13     ",   \
  "     NOT 14     ",   \
  "     NOT 15     ",   \
  "     NOT 16     ",   \
  "      CF 1      ",   \
  "      CF 2      ",   \
  "      CF 3      ",   \
  "      CF 4      ",   \
  "      CF 5      ",   \
  "      CF 6      ",   \
  "      CF 7      ",   \
  "      CF 8      ",   \
  "      CF 9      ",   \
  "     CF 10      ",   \
  "     CF 11      ",   \
  "     CF 12      ",   \
  "     CF 13      ",   \
  "     CF 14      ",   \
  "     CF 15      ",   \
  "     CF 16      ",   \
  "  UD-Logic Er   "

#define NAME_RANG_KZ    \
  "  Блок.вкл.ВВ   ",   \
  " Сброс индикации",   \
  "   Сброс реле   ",   \
  " Местн./Дистанц.",   \
  "  Положение ВВ  ",   \
  "Откл.от вн.защит",   \
  "    Откл.ВВ     ",   \
  "     Вкл.ВВ     ",   \
  " Контроль Откл. ",   \
  " Контроль Вкл.  ",   \
  "   Привод ВВ    ",   \
  " Прев.Iот.ном.  ",   \
  " Крит.Ресурс ВВ ",   \
  " Исч.Ресурс ВВ  ",   \
  "  Вн.доступ ДВх ",   \
  "  Вн.доступ ФК  ",   \
  " Вн.доступ USB  ",   \
  " Вн.доступ RS485",   \
  "  Неиспр.Общая  ",   \
  "  Неиспр.Авар.  ",   \
  " Работа Ан.Рег. ",   \
  " Работа Д.Рег.  ",   \
  " Откл.от защит  ",   \
  "       БО       ",   \
  "       БВ       ",   \
  "  Гр.уставок 1  ",   \
  "  Гр.уставок 2  ",   \
  "  Гр.уставок 3  ",   \
  "  Гр.уставок 4  ",   \
  " В Гр Уст от M  ",   \
  "Блк.гр.уст.от з.",   \
  " С.блк.Гот.к ТУ ",   \
  " Готовность к ТУ",   \
  "  Изм.настроек  ",   \
  "   Блок.МТЗ 1   ",   \
  "   Блок.МТЗ 2   ",   \
  " Блок.уск.МТЗ 2 ",   \
  "   Блок.МТЗ 3   ",   \
  "   Блок.МТЗ 4   ",   \
  " Сект.МТЗН 1 Пр.",   \
  "Сект.МТЗН 1 Обр.",   \
  "    ПО МТЗ 1    ",   \
  " ПО МТЗН 1 Пр.  ",   \
  " ПО МТЗН 1 Обр. ",   \
  "  ПО U МТЗПН 1  ",   \
  "   ПО МТЗПН 1   ",   \
  "     МТЗ 1      ",   \
  " Сект.МТЗН 2 Пр.",   \
  "Сект.МТЗН 2 Обр.",   \
  "    ПО МТЗ 2    ",   \
  " ПО МТЗН 2 Пр.  ",   \
  " ПО МТЗН 2 Обр. ",   \
  "  ПО U МТЗПН 2  ",   \
  "   ПО МТЗПН 2   ",   \
  "     МТЗ 2      ",   \
  " Сект.МТЗН 3 Пр.",   \
  "Сект.МТЗН 3 Обр.",   \
  "    ПО МТЗ 3    ",   \
  " ПО МТЗН 3 Пр.  ",   \
  " ПО МТЗН 3 Обр. ",   \
  "  ПО U МТЗПН 3  ",   \
  "   ПО МТЗПН 3   ",   \
  "     МТЗ 3      ",   \
  " Сект.МТЗН 4 Пр.",   \
  "Сект.МТЗН 4 Обр.",   \
  "    ПО МТЗ 4    ",   \
  " ПО МТЗН 4 Пр.  ",   \
  " ПО МТЗН 4 Обр. ",   \
  "  ПО U МТЗПН 4  ",   \
  "   ПО МТЗПН 4   ",   \
  "     МТЗ 4      ",   \
  " ПО блок.U МТЗН ",   \
  "    НЦН-МТЗ     ",   \
  "Блок.МТЗ 0.4кВ 1",   \
  "Блок.МТЗ 0.4кВ 2",   \
  "Бл.у.МТЗ 0.4кВ 2",   \
  " ПО МТЗ 0.4кВ 1 ",   \
  "  МТЗ 0.4кВ 1   ",   \
  " ПО МТЗ 0.4кВ 2 ",   \
  "  МТЗ 0.4кВ 2   ",   \
  "   Блок.ЗНам    ",   \
  "    ПО ЗНам     ",   \
  "      ЗНам      ",   \
  "    Блок.ЗДЗ    ",   \
  " Пуск ЗДЗ от ДВ ",   \
  " Свет ЗДЗ от ДВ ",   \
  "Свет ЗДЗ от ОВД1",   \
  "Свет ЗДЗ от ОВД2",   \
  "Свет ЗДЗ от ОВД3",   \
  "Свет ЗДЗ от ОВД4",   \
  "     ПО ЗДЗ     ",   \
  "      ЗДЗ       ",   \
  "    Блок.НЗЗ    ",   \
  "     ПО НЗЗ     ",   \
  "      НЗЗ       ",   \
  "   ПО ЗЗ(3I0)   ",   \
  "    ЗЗ(3I0)     ",   \
  "   ПО ЗЗ(3U0)   ",   \
  "    ЗЗ(3U0)     ",   \
  "   Сектор НЗЗ   ",   \
  "  Блок.ТЗНП 1   ",   \
  " Сект.ТЗНП 1 Пр.",   \
  "Сект.ТЗНП 1 Обр.",   \
  "ПО 3I0 ТЗНП1 Пр.",   \
  "ПО 3I0 ТЗНП1 Обр",   \
  "ПО 3U0 ТЗНП1 Пр.",   \
  "ПО 3U0 ТЗНП1 Обр",   \
  " ПО ТЗНП 1 Пр.  ",   \
  " ПО ТЗНП 1 Обр. ",   \
  "     ТЗНП 1     ",   \
  "  Блок.ТЗНП 2   ",   \
  " Сект.ТЗНП 2 Пр.",   \
  "Сект.ТЗНП 2 Обр.",   \
  "ПО 3I0 ТЗНП2 Пр.",   \
  "ПО 3I0 ТЗНП2 Обр",   \
  "ПО 3U0 ТЗНП2 Пр.",   \
  "ПО 3U0 ТЗНП2 Обр",   \
  " ПО ТЗНП 2 Пр.  ",   \
  " ПО ТЗНП 2 Обр. ",   \
  "     ТЗНП 2     ",   \
  "  Блок.ТЗНП 3   ",   \
  " Сект.ТЗНП 3 Пр.",   \
  "Сект.ТЗНП 3 Обр.",   \
  "ПО 3I0 ТЗНП3 Пр.",   \
  "ПО 3I0 ТЗНП3 Обр",   \
  "ПО 3U0 ТЗНП3 Пр.",   \
  "ПО 3U0 ТЗНП3 Обр",   \
  " ПО ТЗНП 3 Пр.  ",   \
  " ПО ТЗНП 3 Обр. ",   \
  "     ТЗНП 3     ",   \
  " Стат.блок.АПВ  ",   \
  "      АПВ       ",   \
  "     АПВ 2      ",   \
  "     АПВ 3      ",   \
  "     АПВ 4      ",   \
  "   Работа АПВ   ",   \
  " АЧР/ЧАПВ от ДВ ",   \
  "   Блок.АЧР 1   ",   \
  "   Блок.АЧР 2   ",   \
  "   Разр.ЧАПВ    ",   \
  "   Блок.ЧАПВ    ",   \
  "    ПО АЧР 1    ",   \
  "   ПО ЧАПВ 1    ",   \
  "   АЧР/ЧАПВ 1   ",   \
  "    ПО АЧР 2    ",   \
  "   ПО ЧАПВ 2    ",   \
  "   АЧР/ЧАПВ 2   ",   \
  "   Блок.УРОВ    ",   \
  " Пуск УРОВ от ДВ",   \
  "    ПО УРОВ     ",   \
  "     УРОВ 1     ",   \
  "     УРОВ 2     ",   \
  "  Блок.ЗОП(I)   ",   \
  "   ПО ЗОП(I)    ",   \
  "     ЗОП(I)     ",   \
  "  Блок.Umin 1   ",   \
  "  Пуск Umin 1   ",   \
  "  Блок.Umin 2   ",   \
  "  Пуск Umin 2   ",   \
  "   ПО Umin 1    ",   \
  " ПО Uблк.Umin 1 ",   \
  " ПО Iблк.Umin 1 ",   \
  "     Umin 1     ",   \
  "   ПО Umin 2    ",   \
  " ПО Uблк.Umin 2 ",   \
  " ПО Iблк.Umin 2 ",   \
  "     Umin 2     ",   \
  "  Блок.Umax 1   ",   \
  "   ПО Umax 1    ",   \
  "     Umax 1     ",   \
  "  Блок.Umax 2   ",   \
  "   ПО Umax 2    ",   \
  "     Umax 2     ",   \
  "   Блок.УЗ x    ",   \
  "    ПО УЗ x     ",   \
  "      УЗ x      ",   \
  " Вх.О-функции 1 ",   \
  " Сбр.О-функции 1",   \
  " Вых.О-функции 1",   \
  " Вх.О-функции 2 ",   \
  " Сбр.О-функции 2",   \
  " Вых.О-функции 2",   \
  " Вх.О-функции 3 ",   \
  " Сбр.О-функции 3",   \
  " Вых.О-функции 3",   \
  " Вх.О-функции 4 ",   \
  " Сбр.О-функции 4",   \
  " Вых.О-функции 4",   \
  " Вх.О-функции 5 ",   \
  " Сбр.О-функции 5",   \
  " Вых.О-функции 5",   \
  " Вх.О-функции 6 ",   \
  " Сбр.О-функции 6",   \
  " Вых.О-функции 6",   \
  " Вх.О-функции 7 ",   \
  " Сбр.О-функции 7",   \
  " Вых.О-функции 7",   \
  " Вх.О-функции 8 ",   \
  " Сбр.О-функции 8",   \
  " Вых.О-функции 8",   \
  "Уст.О-триггера 1",   \
  "Сбр.О-триггера 1",   \
  "Вых.О-триггера 1",   \
  "Уст.О-триггера 2",   \
  "Сбр.О-триггера 2",   \
  "Вых.О-триггера 2",   \
  "Уст.О-триггера 3",   \
  "Сбр.О-триггера 3",   \
  "Вых.О-триггера 3",   \
  "Уст.О-триггера 4",   \
  "Сбр.О-триггера 4",   \
  "Вых.О-триггера 4",   \
  "     О-И 1      ",   \
  "     О-И 2      ",   \
  "     О-И 3      ",   \
  "     О-И 4      ",   \
  "     О-И 5      ",   \
  "     О-И 6      ",   \
  "     О-И 7      ",   \
  "     О-И 8      ",   \
  "    О-ИЛИ 1     ",   \
  "    О-ИЛИ 2     ",   \
  "    О-ИЛИ 3     ",   \
  "    О-ИЛИ 4     ",   \
  "    О-ИЛИ 5     ",   \
  "    О-ИЛИ 6     ",   \
  "    О-ИЛИ 7     ",   \
  "    О-ИЛИ 8     ",   \
  "  О-Искл.ИЛИ 1  ",   \
  "  О-Искл.ИЛИ 2  ",   \
  "  О-Искл.ИЛИ 3  ",   \
  "  О-Искл.ИЛИ 4  ",   \
  "  О-Искл.ИЛИ 5  ",   \
  "  О-Искл.ИЛИ 6  ",   \
  "  О-Искл.ИЛИ 7  ",   \
  "  О-Искл.ИЛИ 8  ",   \
  "     О-НЕ 1     ",   \
  "     О-НЕ 2     ",   \
  "     О-НЕ 3     ",   \
  "     О-НЕ 4     ",   \
  "     О-НЕ 5     ",   \
  "     О-НЕ 6     ",   \
  "     О-НЕ 7     ",   \
  "     О-НЕ 8     ",   \
  "     О-НЕ 9     ",   \
  "    О-НЕ 10     ",   \
  "    О-НЕ 11     ",   \
  "    О-НЕ 12     ",   \
  "    О-НЕ 13     ",   \
  "    О-НЕ 14     ",   \
  "    О-НЕ 15     ",   \
  "    О-НЕ 16     ",   \
  "      ФС 1      ",   \
  "      ФС 2      ",   \
  "      ФС 3      ",   \
  "      ФС 4      ",   \
  "      ФС 5      ",   \
  "      ФС 6      ",   \
  "      ФС 7      ",   \
  "      ФС 8      ",   \
  "      ФС 9      ",   \
  "     ФС 10      ",   \
  "     ФС 11      ",   \
  "     ФС 12      ",   \
  "     ФС 13      ",   \
  "     ФС 14      ",   \
  "     ФС 15      ",   \
  "     ФС 16      ",   \
  " Ош.настр.р.лог."
    
#endif 
